MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_rcc.h
  * @brief   Header file of RCC HAL  module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_RCC_H
#define STM32C5XX_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_rcc.h"
#include "stm32c5xx_ll_bus.h"
#include "stm32c5xx_ll_pwr.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (RCC)

/** @addtogroup RCC
  * @{
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants HAL RCC Constants
  * @{
  */

/** @defgroup RCC_Reset_Flag Reset Flag
  * @{
  */
#define HAL_RCC_RESET_FLAG_PIN   RCC_RSR_PINRSTF    /*!< PIN reset flag */
#define HAL_RCC_RESET_FLAG_PWR   RCC_RSR_BORRSTF    /*!< BOR or POR/PDR reset flag */
#define HAL_RCC_RESET_FLAG_SW    RCC_RSR_SFTRSTF    /*!< Software Reset flag */
#define HAL_RCC_RESET_FLAG_IWDG  RCC_RSR_IWDGRSTF   /*!< Independent Watchdog reset flag */
#define HAL_RCC_RESET_FLAG_WWDG  RCC_RSR_WWDGRSTF   /*!< Window watchdog reset flag */
#define HAL_RCC_RESET_FLAG_LPWR  RCC_RSR_LPWRRSTF   /*!< Low power reset flag */
#define HAL_RCC_RESET_FLAG_ALL   (HAL_RCC_RESET_FLAG_PIN | HAL_RCC_RESET_FLAG_PWR |  \
                                  HAL_RCC_RESET_FLAG_SW | HAL_RCC_RESET_FLAG_IWDG | \
                                  HAL_RCC_RESET_FLAG_WWDG | HAL_RCC_RESET_FLAG_LPWR) /*!< All RCC reset flags */
/**
  * @}
  */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCC_Exported_Types HAL RCC Types
  * @{
  */

/**
  * @brief Peripheral clock activation status.
  */
typedef enum
{
  HAL_RCC_OSC_DISABLED = 0U,                     /*!< Oscillator is disabled */
  HAL_RCC_OSC_ENABLED  = ! HAL_RCC_OSC_DISABLED, /*!< Oscillator is enabled  */
} hal_rcc_osc_enable_status_t;

/**
  * @brief Oscillator ready status.
  */
typedef enum
{
  HAL_RCC_OSC_NOT_READY = 0U,                      /*!< Oscillator is not ready */
  HAL_RCC_OSC_READY     = ! HAL_RCC_OSC_NOT_READY, /*!< Oscillator is ready     */
} hal_rcc_osc_ready_status_t;

/**
  * @brief Oscillator Stop mode status.
  */
typedef enum
{
  HAL_RCC_OSC_DISABLED_IN_STOP_MODE = 0U,                                  /*!< Oscillator is enabled in Run mode only      */
  HAL_RCC_OSC_ENABLED_IN_STOP_MODE  = ! HAL_RCC_OSC_DISABLED_IN_STOP_MODE, /*!< Oscillator is enabled in Run and stop modes */
} hal_rcc_osc_stop_mode_status_t;

/**
  * @brief Clock status
  */
typedef enum
{
  HAL_RCC_CLK_DISABLED = 0U,                      /*!< Clock is disabled */
  HAL_RCC_CLK_ENABLED = ! HAL_RCC_CLK_DISABLED    /*!< Clock is enabled */
} hal_rcc_clk_status_t;

#if defined(HSE_VALUE)
/**
  * @brief HSE state.
  */
typedef enum
{
  HAL_RCC_HSE_ON             = RCC_CR1_HSEON,                                     /*!< HSE clock activation   */
  HAL_RCC_HSE_BYPASS         = (RCC_CR1_HSEBYP | RCC_CR1_HSEON),                  /*!< External Analog clock source for HSE clock */
  HAL_RCC_HSE_BYPASS_DIGITAL = (RCC_CR1_HSEEXT | RCC_CR1_HSEBYP | RCC_CR1_HSEON), /*!< External Digital clock source
                                                                                       for HSE clock  */
} hal_rcc_hse_t;

#endif /* HSE_VALUE */
#if defined(LSE_VALUE)
/**
  * @brief LSE State.
  */
typedef enum
{
  HAL_RCC_LSE_ON              = RCC_RTCCR_LSEON,                                         /*!< LSE clock activation                        */
  HAL_RCC_LSE_BYPASS          = (RCC_RTCCR_LSEBYP | RCC_RTCCR_LSEON),                    /*!< External clock source for LSE clock         */
  HAL_RCC_LSE_BYPASS_DIGITAL  = (RCC_RTCCR_LSEBYP | RCC_RTCCR_LSEEXT | RCC_RTCCR_LSEON), /*!< External digital clock source for LSE clock */
} hal_rcc_lse_t;

#endif /* LSE_VALUE */

/**
  * @brief HSIK Clock Divider.
  */
typedef enum
{
  HAL_RCC_HSIK_DIV1      = LL_RCC_HSIK_DIV_1,          /*!< HSIK = HSI divided by 1    */
  HAL_RCC_HSIK_DIV1_5    = LL_RCC_HSIK_DIV_1_5,        /*!< HSIK = HSI divided by 1.5  */
  HAL_RCC_HSIK_DIV2      = LL_RCC_HSIK_DIV_2,          /*!< HSIK = HSI divided by 2    */
  HAL_RCC_HSIK_DIV2_5    = LL_RCC_HSIK_DIV_2_5,        /*!< HSIK = HSI divided by 2.5  */
  HAL_RCC_HSIK_DIV3      = LL_RCC_HSIK_DIV_3,          /*!< HSIK = HSI divided by 3    */
  HAL_RCC_HSIK_DIV3_5    = LL_RCC_HSIK_DIV_3_5,        /*!< HSIK = HSI divided by 3.5  */
  HAL_RCC_HSIK_DIV4      = LL_RCC_HSIK_DIV_4,          /*!< HSIK = HSI divided by 4    */
  HAL_RCC_HSIK_DIV4_5    = LL_RCC_HSIK_DIV_4_5,        /*!< HSIK = HSI divided by 4.5  */
  HAL_RCC_HSIK_DIV5      = LL_RCC_HSIK_DIV_5,          /*!< HSIK = HSI divided by 5    */
  HAL_RCC_HSIK_DIV5_5    = LL_RCC_HSIK_DIV_5_5,        /*!< HSIK = HSI divided by 5.5  */
  HAL_RCC_HSIK_DIV6      = LL_RCC_HSIK_DIV_6,          /*!< HSIK = HSI divided by 6    */
  HAL_RCC_HSIK_DIV6_5    = LL_RCC_HSIK_DIV_6_5,        /*!< HSIK = HSI divided by 6.5  */
  HAL_RCC_HSIK_DIV7      = LL_RCC_HSIK_DIV_7,          /*!< HSIK = HSI divided by 7    */
  HAL_RCC_HSIK_DIV7_5    = LL_RCC_HSIK_DIV_7_5,        /*!< HSIK = HSI divided by 7.5  */
  HAL_RCC_HSIK_DIV8      = LL_RCC_HSIK_DIV_8,          /*!< HSIK = HSI divided by 8    */
} hal_rcc_hsik_div_t;

/**
  * @brief PSIK Clock Divider.
  */
typedef enum
{
  HAL_RCC_PSIK_DIV1      = LL_RCC_PSIK_DIV_1,          /*!< PSIK = PSI divided by 1    */
  HAL_RCC_PSIK_DIV1_5    = LL_RCC_PSIK_DIV_1_5,        /*!< PSIK = PSI divided by 1.5  */
  HAL_RCC_PSIK_DIV2      = LL_RCC_PSIK_DIV_2,          /*!< PSIK = PSI divided by 2    */
  HAL_RCC_PSIK_DIV2_5    = LL_RCC_PSIK_DIV_2_5,        /*!< PSIK = PSI divided by 2.5  */
  HAL_RCC_PSIK_DIV3      = LL_RCC_PSIK_DIV_3,          /*!< PSIK = PSI divided by 3    */
  HAL_RCC_PSIK_DIV3_5    = LL_RCC_PSIK_DIV_3_5,        /*!< PSIK = PSI divided by 3.5  */
  HAL_RCC_PSIK_DIV4      = LL_RCC_PSIK_DIV_4,          /*!< PSIK = PSI divided by 4    */
  HAL_RCC_PSIK_DIV4_5    = LL_RCC_PSIK_DIV_4_5,        /*!< PSIK = PSI divided by 4.5  */
  HAL_RCC_PSIK_DIV5      = LL_RCC_PSIK_DIV_5,          /*!< PSIK = PSI divided by 5    */
  HAL_RCC_PSIK_DIV5_5    = LL_RCC_PSIK_DIV_5_5,        /*!< PSIK = PSI divided by 5.5  */
  HAL_RCC_PSIK_DIV6      = LL_RCC_PSIK_DIV_6,          /*!< PSIK = PSI divided by 6    */
  HAL_RCC_PSIK_DIV6_5    = LL_RCC_PSIK_DIV_6_5,        /*!< PSIK = PSI divided by 6.5  */
  HAL_RCC_PSIK_DIV7      = LL_RCC_PSIK_DIV_7,          /*!< PSIK = PSI divided by 7    */
  HAL_RCC_PSIK_DIV7_5    = LL_RCC_PSIK_DIV_7_5,        /*!< PSIK = PSI divided by 7.5  */
  HAL_RCC_PSIK_DIV8      = LL_RCC_PSIK_DIV_8,          /*!< PSIK = PSI divided by 8    */
} hal_rcc_psik_div_t;

/**
  * @brief  RCC PSI Reference Clock Source.
  */
typedef enum
{
  HAL_RCC_PSI_SRC_HSE       = LL_RCC_PSISOURCE_HSE,       /*!< HSE clock selected as PSI oscillator entry clock source */
  HAL_RCC_PSI_SRC_LSE       = LL_RCC_PSISOURCE_LSE,       /*!< LSE clock selected as PSI oscillator entry clock source */
  HAL_RCC_PSI_SRC_HSI_8MHz  = LL_RCC_PSISOURCE_HSIDIV18,  /*!< HSI clock divided by 18 (144/18 = 8MHz) selected
                                                                 as PSI oscillator entry clock source */
} hal_rcc_psi_src_t;

/**
  * @brief PSI reference clock frequency selection.
  */
typedef enum
{
  HAL_RCC_PSI_REF_32768HZ      = LL_RCC_PSIREF_32768HZ,/*!< PSI reference clock input is 32768 Hz */
  HAL_RCC_PSI_REF_8MHZ         = LL_RCC_PSIREF_8MHZ,   /*!< PSI reference clock input is 8 MHz    */
  HAL_RCC_PSI_REF_16MHZ        = LL_RCC_PSIREF_16MHZ,  /*!< PSI reference clock input is 16 MHz   */
  HAL_RCC_PSI_REF_24MHZ        = LL_RCC_PSIREF_24MHZ,  /*!< PSI reference clock input is 24 MHz   */
  HAL_RCC_PSI_REF_25MHZ        = LL_RCC_PSIREF_25MHZ,  /*!< PSI reference clock input is 25 MHz   */
  HAL_RCC_PSI_REF_32MHZ        = LL_RCC_PSIREF_32MHZ,  /*!< PSI reference clock input is 32 MHz   */
  HAL_RCC_PSI_REF_48MHZ        = LL_RCC_PSIREF_48MHZ,  /*!< PSI reference clock input is 48 MHz   */
  HAL_RCC_PSI_REF_50MHZ        = LL_RCC_PSIREF_50MHZ,  /*!< PSI reference clock input is 50 MHz   */
} hal_rcc_psi_ref_t;

/**
  * @brief PSI Clock frequency selection.
  */
typedef enum
{
  HAL_RCC_PSI_OUT_100MHZ      = LL_RCC_PSIFREQ_100MHZ,   /*!< PSI output frequency is 100 MHz */
  HAL_RCC_PSI_OUT_144MHZ      = LL_RCC_PSIFREQ_144MHZ,   /*!< PSI output frequency is 144 MHz */
  HAL_RCC_PSI_OUT_160MHZ      = LL_RCC_PSIFREQ_160MHZ,   /*!< PSI output frequency is 160 MHz */
} hal_rcc_psi_out_t;

/**
  * @brief System Clock Source.
  */
typedef enum
{
  HAL_RCC_SYSCLK_SRC_HSIS           = LL_RCC_SYS_CLKSOURCE_HSIS,    /*!< HSIS selected as system clock      */
  HAL_RCC_SYSCLK_SRC_HSIDIV3        = LL_RCC_SYS_CLKSOURCE_HSIDIV3, /*!< HSIDIV3 selection as system clock  */
  HAL_RCC_SYSCLK_SRC_HSE            = LL_RCC_SYS_CLKSOURCE_HSE,     /*!< HSE selection as system clock      */
  HAL_RCC_SYSCLK_SRC_PSIS           = LL_RCC_SYS_CLKSOURCE_PSIS,    /*!< PSIS selection as system clock     */
} hal_rcc_sysclk_src_t;

/**
  * @brief AHB Clock Source.
  */
typedef enum
{
  HAL_RCC_HCLK_PRESCALER1               = LL_RCC_HCLK_PRESCALER_1,   /*!< SYSCLK not divided    */
  HAL_RCC_HCLK_PRESCALER2               = LL_RCC_HCLK_PRESCALER_2,   /*!< SYSCLK divided by 2   */
  HAL_RCC_HCLK_PRESCALER4               = LL_RCC_HCLK_PRESCALER_4,   /*!< SYSCLK divided by 4   */
  HAL_RCC_HCLK_PRESCALER8               = LL_RCC_HCLK_PRESCALER_8,   /*!< SYSCLK divided by 8   */
  HAL_RCC_HCLK_PRESCALER16              = LL_RCC_HCLK_PRESCALER_16,  /*!< SYSCLK divided by 16  */
  HAL_RCC_HCLK_PRESCALER64              = LL_RCC_HCLK_PRESCALER_64,  /*!< SYSCLK divided by 64  */
  HAL_RCC_HCLK_PRESCALER128             = LL_RCC_HCLK_PRESCALER_128, /*!< SYSCLK divided by 128 */
  HAL_RCC_HCLK_PRESCALER256             = LL_RCC_HCLK_PRESCALER_256, /*!< SYSCLK divided by 256 */
  HAL_RCC_HCLK_PRESCALER512             = LL_RCC_HCLK_PRESCALER_512, /*!< SYSCLK divided by 512 */
} hal_rcc_hclk_prescaler_t;

/**
  * @brief APB1 APB2 APB3 Clock Source.
  */
typedef enum
{
  HAL_RCC_PCLK_PRESCALER1                 = LL_RCC_APB1_PRESCALER_1,  /*!< HCLK not divided   */
  HAL_RCC_PCLK_PRESCALER2                 = LL_RCC_APB1_PRESCALER_2,  /*!< HCLK divided by 2  */
  HAL_RCC_PCLK_PRESCALER4                 = LL_RCC_APB1_PRESCALER_4,  /*!< HCLK divided by 4  */
  HAL_RCC_PCLK_PRESCALER8                 = LL_RCC_APB1_PRESCALER_8,  /*!< HCLK divided by 8  */
  HAL_RCC_PCLK_PRESCALER16                = LL_RCC_APB1_PRESCALER_16, /*!< HCLK divided by 16 */
} hal_rcc_pclk_prescaler_t;

/**
  * @brief MCO Clock Source.
  */
typedef enum
{
  HAL_RCC_MCO1_SRC_SYSCLK  = LL_RCC_MCO1SOURCE_SYSCLK,  /*!< SYSCLK selection as MCO1 source  */
  HAL_RCC_MCO1_SRC_HSE     = LL_RCC_MCO1SOURCE_HSE,     /*!< HSE selection as MCO1 source     */
  HAL_RCC_MCO1_SRC_LSE     = LL_RCC_MCO1SOURCE_LSE,     /*!< LSE selection as MCO1 source     */
  HAL_RCC_MCO1_SRC_LSI     = LL_RCC_MCO1SOURCE_LSI,     /*!< LSI selection as MCO1 source     */
  HAL_RCC_MCO1_SRC_PSIK    = LL_RCC_MCO1SOURCE_PSIK,    /*!< PSIK selection as MCO1 source    */
  HAL_RCC_MCO1_SRC_HSIK    = LL_RCC_MCO1SOURCE_HSIK,    /*!< HSIK selection as MCO1 source    */
  HAL_RCC_MCO1_SRC_PSIS    = LL_RCC_MCO1SOURCE_PSIS,    /*!< PSIS selection as MCO1 source    */
  HAL_RCC_MCO1_SRC_HSIS    = LL_RCC_MCO1SOURCE_HSIS,    /*!< HSIS selection as MCO1 source    */
  HAL_RCC_MCO2_SRC_SYSCLK  = LL_RCC_MCO2SOURCE_SYSCLK,  /*!< SYSCLK selection as MCO2 source  */
  HAL_RCC_MCO2_SRC_HSE     = LL_RCC_MCO2SOURCE_HSE,     /*!< HSE selection as MCO2 source     */
  HAL_RCC_MCO2_SRC_LSE     = LL_RCC_MCO2SOURCE_LSE,     /*!< LSE selection as MCO2 source     */
  HAL_RCC_MCO2_SRC_LSI     = LL_RCC_MCO2SOURCE_LSI,     /*!< LSI selection as MCO2 source     */
  HAL_RCC_MCO2_SRC_PSIK    = LL_RCC_MCO2SOURCE_PSIK,    /*!< PSIK selection as MCO2 source    */
  HAL_RCC_MCO2_SRC_HSIK    = LL_RCC_MCO2SOURCE_HSIK,    /*!< HSIK  selection as MCO2 source   */
  HAL_RCC_MCO2_SRC_PSIDIV3 = LL_RCC_MCO2SOURCE_PSIDIV3, /*!< PSIDIV3 selection as MCO2 source */
  HAL_RCC_MCO2_SRC_HSIDIV3 = LL_RCC_MCO2SOURCE_HSIDIV3  /*!< HSIDIV3 selection as MCO2 source */
} hal_rcc_mco_src_t;

/**
  * @brief MCO Clock Prescaler.
  */
typedef enum
{
  HAL_RCC_MCO1_NO_CLK       = LL_RCC_MCO1SOURCE_NOCLOCK,   /*!< MCO1 output disabled, no clock on MCO1 */
  HAL_RCC_MCO1_PRESCALER1   = LL_RCC_MCO1_PRESCALER_1,    /*!< MCO1 clock is divided by 1  */
  HAL_RCC_MCO1_PRESCALER2   = LL_RCC_MCO1_PRESCALER_2,    /*!< MCO1 clock is divided by 2  */
  HAL_RCC_MCO1_PRESCALER3   = LL_RCC_MCO1_PRESCALER_3,    /*!< MCO1 clock is divided by 3  */
  HAL_RCC_MCO1_PRESCALER4   = LL_RCC_MCO1_PRESCALER_4,    /*!< MCO1 clock is divided by 4  */
  HAL_RCC_MCO1_PRESCALER5   = LL_RCC_MCO1_PRESCALER_5,    /*!< MCO1 clock is divided by 5  */
  HAL_RCC_MCO1_PRESCALER6   = LL_RCC_MCO1_PRESCALER_6,    /*!< MCO1 clock is divided by 6  */
  HAL_RCC_MCO1_PRESCALER7   = LL_RCC_MCO1_PRESCALER_7,    /*!< MCO1 clock is divided by 7  */
  HAL_RCC_MCO1_PRESCALER8   = LL_RCC_MCO1_PRESCALER_8,    /*!< MCO1 clock is divided by 8  */
  HAL_RCC_MCO1_PRESCALER9   = LL_RCC_MCO1_PRESCALER_9,    /*!< MCO1 clock is divided by 9  */
  HAL_RCC_MCO1_PRESCALER10  = LL_RCC_MCO1_PRESCALER_10,   /*!< MCO1 clock is divided by 10 */
  HAL_RCC_MCO1_PRESCALER11  = LL_RCC_MCO1_PRESCALER_11,   /*!< MCO1 clock is divided by 11 */
  HAL_RCC_MCO1_PRESCALER12  = LL_RCC_MCO1_PRESCALER_12,   /*!< MCO1 clock is divided by 12 */
  HAL_RCC_MCO1_PRESCALER13  = LL_RCC_MCO1_PRESCALER_13,   /*!< MCO1 clock is divided by 13 */
  HAL_RCC_MCO1_PRESCALER14  = LL_RCC_MCO1_PRESCALER_14,   /*!< MCO1 clock is divided by 14 */
  HAL_RCC_MCO1_PRESCALER15  = LL_RCC_MCO1_PRESCALER_15,   /*!< MCO1 clock is divided by 15 */
  HAL_RCC_MCO2_NO_CLK       = LL_RCC_MCO2SOURCE_NOCLOCK,  /*!< MCO2 output disabled, no clock on MCO2 */
  HAL_RCC_MCO2_PRESCALER1   = LL_RCC_MCO2_PRESCALER_1,    /*!< MCO2 clock is divided by 1  */
  HAL_RCC_MCO2_PRESCALER2   = LL_RCC_MCO2_PRESCALER_2,    /*!< MCO2 clock is divided by 2  */
  HAL_RCC_MCO2_PRESCALER3   = LL_RCC_MCO2_PRESCALER_3,    /*!< MCO2 clock is divided by 3  */
  HAL_RCC_MCO2_PRESCALER4   = LL_RCC_MCO2_PRESCALER_4,    /*!< MCO2 clock is divided by 4  */
  HAL_RCC_MCO2_PRESCALER5   = LL_RCC_MCO2_PRESCALER_5,    /*!< MCO2 clock is divided by 5  */
  HAL_RCC_MCO2_PRESCALER6   = LL_RCC_MCO2_PRESCALER_6,    /*!< MCO2 clock is divided by 6  */
  HAL_RCC_MCO2_PRESCALER7   = LL_RCC_MCO2_PRESCALER_7,    /*!< MCO2 clock is divided by 7  */
  HAL_RCC_MCO2_PRESCALER8   = LL_RCC_MCO2_PRESCALER_8,    /*!< MCO2 clock is divided by 8  */
  HAL_RCC_MCO2_PRESCALER9   = LL_RCC_MCO2_PRESCALER_9,    /*!< MCO2 clock is divided by 9  */
  HAL_RCC_MCO2_PRESCALER10  = LL_RCC_MCO2_PRESCALER_10,   /*!< MCO2 clock is divided by 10 */
  HAL_RCC_MCO2_PRESCALER11  = LL_RCC_MCO2_PRESCALER_11,   /*!< MCO2 clock is divided by 11 */
  HAL_RCC_MCO2_PRESCALER12  = LL_RCC_MCO2_PRESCALER_12,   /*!< MCO2 clock is divided by 12 */
  HAL_RCC_MCO2_PRESCALER13  = LL_RCC_MCO2_PRESCALER_13,   /*!< MCO2 clock is divided by 13 */
  HAL_RCC_MCO2_PRESCALER14  = LL_RCC_MCO2_PRESCALER_14,   /*!< MCO2 clock is divided by 14 */
  HAL_RCC_MCO2_PRESCALER15  = LL_RCC_MCO2_PRESCALER_15,   /*!< MCO2 clock is divided by 15 */
} hal_rcc_mco_prescaler_t;

#if defined(LSE_VALUE)
/**
  * @brief LSE Drive Configuration.
  */
typedef enum
{
  HAL_RCC_LSE_DRIVE_LOW                = LL_RCC_LSEDRIVE_LOW,        /*!< LSE low drive capability         */
  HAL_RCC_LSE_DRIVE_MEDIUMLOW          = LL_RCC_LSEDRIVE_MEDIUMLOW,  /*!< LSE medium low drive capability  */
  HAL_RCC_LSE_DRIVE_MEDIUMHIGH         = LL_RCC_LSEDRIVE_MEDIUMHIGH, /*!< LSE medium high drive capability */
  HAL_RCC_LSE_DRIVE_HIGH               = LL_RCC_LSEDRIVE_HIGH,       /*!< LSE high drive capability        */
} hal_rcc_lse_drive_t;

#endif /* LSE_VALUE */

/**
  * @brief Wake-Up from STOP Clock.
  */
typedef enum
{
  HAL_RCC_STOP_WAKEUPCLOCK_HSIDIV3     = LL_RCC_STOP_WAKEUPCLOCK_HSIDIV3, /*!< HSIDIV3 selected after wake-up from STOP */
  HAL_RCC_STOP_WAKEUPCLOCK_HSIS        = LL_RCC_STOP_WAKEUPCLOCK_HSIS,    /*!< HSIS selected after wake-up from STOP    */
} hal_rcc_stop_wakeup_clk_t;


/**
  * @brief Low Speed Clock Source.
  */
typedef enum
{
  HAL_RCC_LSCO_SRC_LSI              = LL_RCC_LSCO_CLKSOURCE_LSI,      /*!< LSI selected for low speed clock output */
  HAL_RCC_LSCO_SRC_LSE              = LL_RCC_LSCO_CLKSOURCE_LSE,      /*!< LSE selected for low speed clock output */
} hal_rcc_lsco_src_t;

/**
  * @brief RTC Clock Source.
  */
typedef enum
{
  HAL_RCC_RTC_CLK_SRC_NONE         = LL_RCC_RTC_CLKSOURCE_NONE,      /*!< No clock used as RTC clock                 */
  HAL_RCC_RTC_CLK_SRC_LSE          = LL_RCC_RTC_CLKSOURCE_LSE,       /*!< LSE oscillator clock used as RTC clock     */
  HAL_RCC_RTC_CLK_SRC_LSI          = LL_RCC_RTC_CLKSOURCE_LSI,       /*!< LSI oscillator clock used as RTC clock     */
  HAL_RCC_RTC_CLK_SRC_HSE_DIV      = LL_RCC_RTC_CLKSOURCE_HSE_DIV,   /*!< HSE oscillator clock divided by RTCPRE[]
                                                                           used as RTC clock                         */
} hal_rcc_rtc_clk_src_t;

/**
  * @brief USART1 Clock Source.
  */
typedef enum
{
  HAL_RCC_USART1_CLK_SRC_PCLK2      = LL_RCC_USART1_CLKSOURCE_PCLK2, /*!< PCLK2 selected as USART1 kernel clock */
  HAL_RCC_USART1_CLK_SRC_PSIK       = LL_RCC_USART1_CLKSOURCE_PSIK,  /*!< PSIK selected as USART1 kernel clock  */
  HAL_RCC_USART1_CLK_SRC_HSIK       = LL_RCC_USART1_CLKSOURCE_HSIK,  /*!< HSIK selected as USART1 kernel clock  */
  HAL_RCC_USART1_CLK_SRC_LSE        = LL_RCC_USART1_CLKSOURCE_LSE,   /*!< LSE selected as USART1 kernel clock   */
} hal_rcc_usart1_clk_src_t;

/**
  * @brief USART2 Clock Source.
  */
typedef enum
{
  HAL_RCC_USART2_CLK_SRC_PCLK1      = LL_RCC_USART2_CLKSOURCE_PCLK1, /*!< PCLK1 selected as USART2 kernel clock */
  HAL_RCC_USART2_CLK_SRC_PSIK       = LL_RCC_USART2_CLKSOURCE_PSIK,  /*!< PSIK selected as USART2 kernel clock  */
  HAL_RCC_USART2_CLK_SRC_HSIK       = LL_RCC_USART2_CLKSOURCE_HSIK,  /*!< HSIK selected as USART2 kernel clock  */
  HAL_RCC_USART2_CLK_SRC_LSE        = LL_RCC_USART2_CLKSOURCE_LSE,   /*!< LSE selected as USART2 kernel clock   */
} hal_rcc_usart2_clk_src_t;

#if defined(USART3)
/**
  * @brief USART3 Clock Source.
  */
typedef enum
{
  HAL_RCC_USART3_CLK_SRC_PCLK1      = LL_RCC_USART3_CLKSOURCE_PCLK1, /*!< PCLK1 selected as USART3 kernel clock */
  HAL_RCC_USART3_CLK_SRC_PSIK       = LL_RCC_USART3_CLKSOURCE_PSIK,  /*!< PSIK selected as USART3 kernel clock  */
  HAL_RCC_USART3_CLK_SRC_HSIK       = LL_RCC_USART3_CLKSOURCE_HSIK,  /*!< HSIK selected as USART3 kernel clock  */
  HAL_RCC_USART3_CLK_SRC_LSE        = LL_RCC_USART3_CLKSOURCE_LSE,   /*!< LSE selected as USART3 kernel clock   */
} hal_rcc_usart3_clk_src_t;

#endif /* USART3 */
/**
  * @brief UART4 Clock Source.
  */
typedef enum
{
  HAL_RCC_UART4_CLK_SRC_PCLK1       = LL_RCC_UART4_CLKSOURCE_PCLK1, /*!< PCLK1 selected as UART4 kernel clock */
  HAL_RCC_UART4_CLK_SRC_PSIK        = LL_RCC_UART4_CLKSOURCE_PSIK,  /*!< PSIK selected as UART4 kernel clock  */
  HAL_RCC_UART4_CLK_SRC_HSIK        = LL_RCC_UART4_CLKSOURCE_HSIK,  /*!< HSIK selected as UART4 kernel clock  */
  HAL_RCC_UART4_CLK_SRC_LSE         = LL_RCC_UART4_CLKSOURCE_LSE,   /*!< LSE selected as UART4 kernel clock   */
} hal_rcc_uart4_clk_src_t;

/**
  * @brief UART5 Clock Source.
  */
typedef enum
{
  HAL_RCC_UART5_CLK_SRC_PCLK1       = LL_RCC_UART5_CLKSOURCE_PCLK1, /*!< PCLK1 selected as UART5 kernel clock */
  HAL_RCC_UART5_CLK_SRC_PSIK        = LL_RCC_UART5_CLKSOURCE_PSIK,  /*!< PSIK selected as UART5 kernel clock  */
  HAL_RCC_UART5_CLK_SRC_HSIK        = LL_RCC_UART5_CLKSOURCE_HSIK,  /*!< HSIK selected as UART5 kernel clock  */
  HAL_RCC_UART5_CLK_SRC_LSE         = LL_RCC_UART5_CLKSOURCE_LSE,   /*!< LSE selected as UART5 kernel clock   */
} hal_rcc_uart5_clk_src_t;

#if defined(USART6)
/**
  * @brief USART6 Clock Source.
  */
typedef enum
{
  HAL_RCC_USART6_CLK_SRC_PCLK1      = LL_RCC_USART6_CLKSOURCE_PCLK1, /*!< PCLK1 selected as USART6 kernel clock */
  HAL_RCC_USART6_CLK_SRC_PSIK       = LL_RCC_USART6_CLKSOURCE_PSIK,  /*!< PSIK selected as USART6 kernel clock  */
  HAL_RCC_USART6_CLK_SRC_HSIK       = LL_RCC_USART6_CLKSOURCE_HSIK,  /*!< HSIK selected as USART6 kernel clock  */
  HAL_RCC_USART6_CLK_SRC_LSE        = LL_RCC_USART6_CLKSOURCE_LSE,   /*!< LSE selected as USART6 kernel clock   */
} hal_rcc_usart6_clk_src_t;

#endif /* USART6 */
#if defined(UART7)
/**
  * @brief UART7 Clock Source.
  */
typedef enum
{
  HAL_RCC_UART7_CLK_SRC_PCLK1       = LL_RCC_UART7_CLKSOURCE_PCLK1, /*!< PCLK1 selected as UART7 kernel clock */
  HAL_RCC_UART7_CLK_SRC_PSIK        = LL_RCC_UART7_CLKSOURCE_PSIK,  /*!< PSIK selected as UART7 kernel clock  */
  HAL_RCC_UART7_CLK_SRC_HSIK        = LL_RCC_UART7_CLKSOURCE_HSIK,  /*!< HSIK selected as UART7 kernel clock  */
  HAL_RCC_UART7_CLK_SRC_LSE         = LL_RCC_UART7_CLKSOURCE_LSE,   /*!< LSE selected as UART7 kernel clock   */
} hal_rcc_uart7_clk_src_t;

#endif /* UART7 */
/**
  * @brief LPUART1 Clock Source.
  */
typedef enum
{
  HAL_RCC_LPUART1_CLK_SRC_PCLK3     = LL_RCC_LPUART1_CLKSOURCE_PCLK3, /*!< PCLK3 selected as LPUART1 kernel clock */
  HAL_RCC_LPUART1_CLK_SRC_HSIK      = LL_RCC_LPUART1_CLKSOURCE_HSIK,  /*!< HSIK selected as LPUART1 kernel clock  */
  HAL_RCC_LPUART1_CLK_SRC_LSE       = LL_RCC_LPUART1_CLKSOURCE_LSE,   /*!< LSE selected as LPUART1 kernel clock   */
  HAL_RCC_LPUART1_CLK_SRC_LSI       = LL_RCC_LPUART1_CLKSOURCE_LSI,   /*!< LSI selected as LPUART1 kernel clock   */
} hal_rcc_lpuart1_clk_src_t;

/**
  * @brief SPI1 Clock Source.
  */
typedef enum
{
  HAL_RCC_SPI1_CLK_SRC_PCLK2        = LL_RCC_SPI1_CLKSOURCE_PCLK2,     /*!< PCLK2 selected as SPI1 kernel clock    */
  HAL_RCC_SPI1_CLK_SRC_PSIK         = LL_RCC_SPI1_CLKSOURCE_PSIK,      /*!< PSIK selected as SPI1 kernel clock     */
  HAL_RCC_SPI1_CLK_SRC_HSIK         = LL_RCC_SPI1_CLKSOURCE_HSIK,      /*!< HSIK selected as SPI1 kernel clock     */
  HAL_RCC_SPI1_CLK_SRC_AUDIOCLK     = LL_RCC_SPI1_CLKSOURCE_AUDIOCLK,  /*!< AUDIOCLK selected as SPI1 kernel clock */
} hal_rcc_spi1_clk_src_t;

/**
  * @brief SPI2 Clock Source.
  */
typedef enum
{
  HAL_RCC_SPI2_CLK_SRC_PCLK1        = LL_RCC_SPI2_CLKSOURCE_PCLK1,     /*!< PCLK1 selected as SPI2 kernel clock    */
  HAL_RCC_SPI2_CLK_SRC_PSIK         = LL_RCC_SPI2_CLKSOURCE_PSIK,      /*!< PSIK selected as SPI2 kernel clock     */
  HAL_RCC_SPI2_CLK_SRC_HSIK         = LL_RCC_SPI2_CLKSOURCE_HSIK,      /*!< HSIK selected as SPI2 kernel clock     */
  HAL_RCC_SPI2_CLK_SRC_AUDIOCLK     = LL_RCC_SPI2_CLKSOURCE_AUDIOCLK,  /*!< AUDIOCLK selected as SPI2 kernel clock */
} hal_rcc_spi2_clk_src_t;

