MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
#if defined(SPI3)
/**
  * @brief SPI3 Clock Source.
  */
typedef enum
{
  HAL_RCC_SPI3_CLK_SRC_PCLK1        = LL_RCC_SPI3_CLKSOURCE_PCLK1,     /*!< PCLK1 selected as SPI3 kernel clock    */
  HAL_RCC_SPI3_CLK_SRC_PSIK         = LL_RCC_SPI3_CLKSOURCE_PSIK,      /*!< PSIK selected as SPI3 kernel clock     */
  HAL_RCC_SPI3_CLK_SRC_HSIK         = LL_RCC_SPI3_CLKSOURCE_HSIK,      /*!< HSIK selected as SPI3 kernel clock     */
  HAL_RCC_SPI3_CLK_SRC_AUDIOCLK     = LL_RCC_SPI3_CLKSOURCE_AUDIOCLK,  /*!< AUDIOCLK selected as SPI3 kernel clock */
} hal_rcc_spi3_clk_src_t;

#endif /* SPI3 */
#if defined(FDCAN1)
/**
  * @brief FDCAN Kernel Clock Source.
  */
typedef enum
{
  HAL_RCC_FDCAN_CLK_SRC_PCLK1       = LL_RCC_FDCAN_CLKSOURCE_PCLK1, /*!< PCLK1 selected as FDCAN kernel clock */
  HAL_RCC_FDCAN_CLK_SRC_PSIS        = LL_RCC_FDCAN_CLKSOURCE_PSIS,  /*!< PSIS selected as FDCAN kernel clock  */
  HAL_RCC_FDCAN_CLK_SRC_PSIK        = LL_RCC_FDCAN_CLKSOURCE_PSIK,  /*!< PSIK selected as FDCAN kernel clock  */
  HAL_RCC_FDCAN_CLK_SRC_HSE         = LL_RCC_FDCAN_CLKSOURCE_HSE,   /*!< HSE selected as FDCAN kernel clock   */
} hal_rcc_fdcan_clk_src_t;

#endif /* FDCAN1 */
/**
  * @brief I2C1 Clock Source.
  */
typedef enum
{
  HAL_RCC_I2C1_CLK_SRC_PCLK1        = LL_RCC_I2C1_CLKSOURCE_PCLK1, /*!< PCLK1 selected as I2C1 kernel clock */
  HAL_RCC_I2C1_CLK_SRC_PSIK         = LL_RCC_I2C1_CLKSOURCE_PSIK,  /*!< PSIK selected as I2C1 kernel clock  */
  HAL_RCC_I2C1_CLK_SRC_HSIK         = LL_RCC_I2C1_CLKSOURCE_HSIK,  /*!< HSIK selected as I2C1 kernel clock  */
} hal_rcc_i2c1_clk_src_t;

#if defined(I2C2)
/**
  * @brief I2C2 Clock Source.
  */
typedef enum
{
  HAL_RCC_I2C2_CLK_SRC_PCLK1        = LL_RCC_I2C2_CLKSOURCE_PCLK1, /*!< PCLK1 selected as I2C2 kernel clock */
  HAL_RCC_I2C2_CLK_SRC_PSIK         = LL_RCC_I2C2_CLKSOURCE_PSIK,  /*!< PSIK selected as I2C2 kernel clock  */
  HAL_RCC_I2C2_CLK_SRC_HSIK         = LL_RCC_I2C2_CLKSOURCE_HSIK,  /*!< HSIK selected as I2C2 kernel clock  */
} hal_rcc_i2c2_clk_src_t;

#endif /* I2C2 */
/**
  * @brief I3C1 Clock Source.
  */
typedef enum
{
  HAL_RCC_I3C1_CLK_SRC_PCLK1        = LL_RCC_I3C1_CLKSOURCE_PCLK1, /*!< PCLK1 selected as I3C1 kernel clock */
  HAL_RCC_I3C1_CLK_SRC_PSIK         = LL_RCC_I3C1_CLKSOURCE_PSIK,  /*!< PSIK selected as I3C1 kernel clock  */
  HAL_RCC_I3C1_CLK_SRC_HSIK         = LL_RCC_I3C1_CLKSOURCE_HSIK,  /*!< HSIK selected as I3C1 kernel clock  */
} hal_rcc_i3c1_clk_src_t;

/**
  * @brief ADCDAC Clock Source.
  */
typedef enum
{
  HAL_RCC_ADCDAC_CLK_SRC_HCLK       = LL_RCC_ADCDAC_CLKSOURCE_HCLK,   /*!< HCLK selected as ADCDAC kernel clock */
  HAL_RCC_ADCDAC_CLK_SRC_PSIS       = LL_RCC_ADCDAC_CLKSOURCE_PSIS,   /*!< PSIS selected as ADCDAC kernel clock */
  HAL_RCC_ADCDAC_CLK_SRC_PSIK       = LL_RCC_ADCDAC_CLKSOURCE_PSIK,   /*!< PSIK selected as ADCDAC kernel clock */
  HAL_RCC_ADCDAC_CLK_SRC_HSIK       = LL_RCC_ADCDAC_CLKSOURCE_HSIK,   /*!< HSIK selected as ADCDAC kernel clock */
} hal_rcc_adcdac_clk_src_t;

/**
  * @brief Clock Prescaler for ADCDAC kernel clock.
  */
typedef enum
{
  HAL_RCC_ADCDAC_PRESCALER1   = LL_RCC_ADCDAC_PRESCALER_1,  /*!< Prescaler 1 for ADC and DAC kernel clock   */
  HAL_RCC_ADCDAC_PRESCALER2   = LL_RCC_ADCDAC_PRESCALER_2,  /*!< Prescaler 2 for ADC and DAC kernel clock   */
  HAL_RCC_ADCDAC_PRESCALER4   = LL_RCC_ADCDAC_PRESCALER_4,  /*!< Prescaler 4 for ADC and DAC kernel clock   */
  HAL_RCC_ADCDAC_PRESCALER8   = LL_RCC_ADCDAC_PRESCALER_8,  /*!< Prescaler 8 for ADC and DAC kernel clock   */
  HAL_RCC_ADCDAC_PRESCALER16  = LL_RCC_ADCDAC_PRESCALER_16, /*!< Prescaler 16 for ADC and DAC kernel clock  */
  HAL_RCC_ADCDAC_PRESCALER32  = LL_RCC_ADCDAC_PRESCALER_32, /*!< Prescaler 32 for ADC and DAC kernel clock  */
  HAL_RCC_ADCDAC_PRESCALER64  = LL_RCC_ADCDAC_PRESCALER_64, /*!< Prescaler 64 for ADC and DAC kernel clock  */
  HAL_RCC_ADCDAC_PRESCALER128 = LL_RCC_ADCDAC_PRESCALER_128 /*!< Prescaler 128 for ADC and DAC kernel clock */
} hal_rcc_adcdac_prescaler_t;
/**
  * @brief DAC1 sample-and-hold clock source.
  */
typedef enum
{
  HAL_RCC_DAC1_SH_CLK_SRC_LSE = LL_RCC_DAC1SH_CLKSOURCE_LSE, /*!< LSE selected as DAC1 SH clock source */
  HAL_RCC_DAC1_SH_CLK_SRC_LSI = LL_RCC_DAC1SH_CLKSOURCE_LSI  /*!< LSI selected as DAC1 SH clock source */
} hal_rcc_dac1_sh_clk_src_t;

#if defined(LPTIM1)
/**
  * @brief LPTIM1 Clock Source.
  */
typedef enum
{
  HAL_RCC_LPTIM1_CLK_SRC_PCLK3      = LL_RCC_LPTIM1_CLKSOURCE_PCLK3, /*!< PCLK3 selected as LPTIM1 kernel clock */
  HAL_RCC_LPTIM1_CLK_SRC_HSIK       = LL_RCC_LPTIM1_CLKSOURCE_HSIK,  /*!< HSIK selected as LPTIM1 kernel clock  */
  HAL_RCC_LPTIM1_CLK_SRC_LSE        = LL_RCC_LPTIM1_CLKSOURCE_LSE,   /*!< LSE selected as LPTIM1 kernel clock   */
  HAL_RCC_LPTIM1_CLK_SRC_LSI        = LL_RCC_LPTIM1_CLKSOURCE_LSI,   /*!< LSI selected as LPTIM1 kernel clock   */
} hal_rcc_lptim1_clk_src_t;

#endif /* LPTIM1 */
/**
  * @brief CK48 Clock Source (Used for RNG and USB).
  */
typedef enum
{
  HAL_RCC_CK48_CLK_SRC_PSIDIV3      = LL_RCC_CK48_CLKSOURCE_PSIDIV3, /*!< PSIDIV3 selected as CK48 clock source */
  HAL_RCC_CK48_CLK_SRC_HSIDIV3      = LL_RCC_CK48_CLKSOURCE_HSIDIV3, /*!< HSIDIV3 selected as CK48 clock source */
  HAL_RCC_CK48_CLK_SRC_HSE          = LL_RCC_CK48_CLKSOURCE_HSE,     /*!< HSE selected as CK48 clock source     */
} hal_rcc_ck48_clk_src_t;

#if defined(XSPI1)
/**
  * @brief XSPI1 Clock Source.
  */
typedef enum
{
  HAL_RCC_XSPI1_CLK_SRC_HCLK      = LL_RCC_XSPI1_CLKSOURCE_HCLK, /*!< HCLK selected as XSPI1 kernel clock */
  HAL_RCC_XSPI1_CLK_SRC_PSIK      = LL_RCC_XSPI1_CLKSOURCE_PSIK, /*!< PSIK selected as XSPI1 kernel clock */
  HAL_RCC_XSPI1_CLK_SRC_HSIK      = LL_RCC_XSPI1_CLKSOURCE_HSIK  /*!< HSIK selected as XSPI1 kernel clock */
} hal_rcc_xspi1_clk_src_t;

#endif /* XSPI1 */
#if defined(ETH1)
/**
  * @brief ETH1 REF Clock Source.
  */
typedef enum
{
  HAL_RCC_ETH1REF_CLK_SRC_RMII    = LL_RCC_ETH1REF_CLKSOURCE_RMII, /*!< RMII selected as ETH1REF clock source */
  HAL_RCC_ETH1REF_CLK_SRC_FB      = LL_RCC_ETH1REF_CLKSOURCE_FB    /*!< FB selected as ETH1REF clock source   */
} hal_rcc_eth1ref_clk_src_t;

/**
  * @brief ETH1 PTP Clock Source.
  */
typedef enum
{
  HAL_RCC_ETH1PTP_CLK_SRC_NONE      = LL_RCC_ETH1PTP_CLKSOURCE_NONE, /*!< NONE selected as ETH1PTP clock source */
  HAL_RCC_ETH1PTP_CLK_SRC_HCLK      = LL_RCC_ETH1PTP_CLKSOURCE_HCLK, /*!< HCLK selected as ETH1PTP clock source */
  HAL_RCC_ETH1PTP_CLK_SRC_PSIS      = LL_RCC_ETH1PTP_CLKSOURCE_PSIS, /*!< PSIS selected as ETH1PTP clock source */
  HAL_RCC_ETH1PTP_CLK_SRC_PSIK      = LL_RCC_ETH1PTP_CLKSOURCE_PSIK  /*!< PSIK selected as ETH1PTP clock source */
} hal_rcc_eth1ptp_clk_src_t;

/**
  * @brief ETH1 Clock Source.
  */
typedef enum
{
  HAL_RCC_ETH1_CLK_SRC_NONE  = LL_RCC_ETH1_CLKSOURCE_NONE, /*!< NONE selected as ETH1 clock source */
  HAL_RCC_ETH1_CLK_SRC_PSIS  = LL_RCC_ETH1_CLKSOURCE_PSIS, /*!< PSIS selected as ETH1 clock source */
  HAL_RCC_ETH1_CLK_SRC_PSIK  = LL_RCC_ETH1_CLKSOURCE_PSIK, /*!< PSIK selected as ETH1 clock source */
  HAL_RCC_ETH1_CLK_SRC_HSE   = LL_RCC_ETH1_CLKSOURCE_HSE   /*!< HSE selected as ETH1 clock source  */
} hal_rcc_eth1_clk_src_t;

/**
  * @brief ETH1 Clock Divider.
  */
typedef enum
{
  HAL_RCC_ETH1_PRESCALER1    = LL_RCC_ETH1_PRESCALER_1,     /*!< ETH1 clock is divided by 1 */
  HAL_RCC_ETH1_PRESCALER2    = LL_RCC_ETH1_PRESCALER_2,     /*!< ETH1 clock is divided by 2 */
  HAL_RCC_ETH1_PRESCALER4    = LL_RCC_ETH1_PRESCALER_4,     /*!< ETH1 clock is divided by 4 */
} hal_rcc_eth1_prescaler_t;

#endif /* ETH1 */

/**
  * @brief SYSTICK Clock Source.
  */
typedef enum
{
  HAL_RCC_SYSTICK_CLK_SRC_HCLKDIV8 = LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8, /*!< HCLK_DIV8 clock used as SYSTICK clock */
  HAL_RCC_SYSTICK_CLK_SRC_LSI = LL_RCC_SYSTICK_CLKSOURCE_LSI,           /*!< LSI clock used as SYSTICK clock       */
  HAL_RCC_SYSTICK_CLK_SRC_LSE = LL_RCC_SYSTICK_CLKSOURCE_LSE            /*!< LSE clock used as SYSTICK clock       */
} hal_rcc_systick_clk_src_t;

/**
  * @brief Privileged access level attribute
  */
typedef enum
{
  HAL_RCC_NPRIV = LL_RCC_ATTR_NPRIV, /*!< Non-privileged access level attribute */
  HAL_RCC_PRIV  = LL_RCC_ATTR_PRIV   /*!< Privileged access level attribute     */
} hal_rcc_priv_attr_t;

/**
  * @brief RCC attributes configuration items
  */
#define HAL_RCC_PRIV_ITEM_ALL              LL_RCC_PRIV_ITEM_ALL           /*!< All RCC resources privilege configuration item  */
/**
  * @}
  */

/**
  * @brief  RCC System, AHB and APB buses clock configuration structure definition.
  */
typedef struct
{
  hal_rcc_hclk_prescaler_t hclk_prescaler; /*!< The HCLK (AHB clock) prescaler. This clock is derived from the system clock
                                           (SYSCLK).                                                */

  hal_rcc_pclk_prescaler_t pclk1_prescaler;  /*!< The PCLK1 (APB1 clock) prescaler.
                                             This clock is derived from the AHB clock (HCLK).       */

  hal_rcc_pclk_prescaler_t pclk2_prescaler;  /*!< The PCLK2 (APB2 clock) prescaler.
                                             This clock is derived from the AHB clock (HCLK).       */

