MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
  hal_rcc_pclk_prescaler_t pclk3_prescaler;  /*!< The PCLK3 (APB3 clock) prescaler.
                                            This clock is derived from the AHB clock (HCLK).        */
} hal_rcc_bus_clk_config_t;

/**
  * @brief  RCC PSI configuration structure definition.
  */
typedef struct
{
  hal_rcc_psi_src_t psi_source;        /*!< PSI entry clock source selection  */

  hal_rcc_psi_ref_t psi_ref;           /*!< PSI entry clock source frequency  */

  hal_rcc_psi_out_t psi_out;           /*!< PSI clock frequency output        */

} hal_rcc_psi_config_t;

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_Exported_Functions HAL RCC Functions
  * @{
  *
  */

/** @defgroup RCC_Exported_Functions_Group1 Oscillators, PSI, bus configurations, RCC and system clock reset functions
  This section provides functions allowing to configure the internal and external oscillators
  (HSE, HSIS, LSE, LSI, HSIDIV3, HSIK, PSIS, PSIDIV3, PSIK, HSIDIV18), CSS, MCO and the System buses clocks
  (SYSCLK, AHB, APB1, APB2 and APB3).

  - Internal/external clock and PSI configuration:

    - HSIS (High-Speed Internal System): 144 MHz factory-trimmed RC used as System clock source.

    - HSIDIV3 (High-Speed Internal Divided by 3): HSI clock divided by 3 (48 MHz) used for USB, RNG
      or as System clock source.

    - HSIK (High-Speed Internal Kernel Clock): Used for peripherals as kernel clock.

    - PSIS (Precise-Speed Internal System): PSIS configurable to several ranges used as System clock source.

    - PSIDIV3 (Precise-Speed Internal Divided by 3): PSI clock divided by 3 can be used for USB or RNG.

    - PSIK (Precise-Speed Internal Kernel Clock): Used for peripherals as kernel clock.

    - LSI (Low-Speed Internal): 32 kHz low consumption RC used as IWDG
    and/or RTC clock source. It can be selected by some peripherals as kernel clock.

    - HSE (High-Speed External): crystal or clock, from 4 to 50 MHz, used directly or
    through the PSI as System clock source. Can be used also optionally as RTC, USB, RNG or FDCAN clock source.

    - LSE (low-speed external): 32.768 kHz oscillator used optionally as RTC clock source. Used
    through the PSI as System clock source. Used for peripherals as kernel clock.

    - HSIDIV18 (High-Speed Internal Divided by 18): HSI clock divided by 18 (8 MHz). Used through the
    PSI as System clock source.


  - System, AHB and APB buses clocks configuration:

    - Several clock sources can be used to drive the System clock (SYSCLK): HSIS, HSI_DIV3
    HSE and PSIS.
    The AHB clock (HCLK) is derived from System clock through configurable
    prescaler and used to clock the CPU, memory and peripherals mapped
    on AHB bus (DMA, GPIO...). APB1 (PCLK1), APB2 (PCLK2) and APB3 (PCLK3) clocks are derived
    from AHB clock through configurable prescalers and used to clock
    the peripherals mapped on these buses.

    - All the peripheral bus clocks are derived from the System clock (SYSCLK) except:

      - RTC: the RTC clock can be derived either from the LSI, LSE or HSE clock
      divided by 2 to 511.
      - USB Host and Device FS and RNG: USB Host and Device FS require a frequency equal to 48 MHz
      to work correctly, while RNG peripherals require a frequency
      equal or lower than to 48 MHz. This clock is derived of the PSIDIV3, HSIDIV3 or HSE
      - IWDG clock which is always the LSI clock.
      - DAC1 sample and hold clock. This clock is derived from LSI or LSE.

    - The maximum frequency of the SYSCLK, HCLK, PCLK1, PCLK2 and PCLK3 is 144 MHz.
    To correctly read data from Flash memory, the number of wait states (latency) must be
    correctly programmed in the FLASH register according to the
    frequency of the CPU clock (HCLK) and the internal voltage range of the device VCORE.

    When changing the CPU frequency, a software sequence must be applied
    in order to tune the number of wait states needed to access the flash memory:
    - FLASH latency must be increased before increasing the HCLK frequency
    - FLASH latency can be decreased only after decreasing the HCLK frequency

    The table below shows the correspondence between wait states and CPU clock frequency.

    Table 1. HCLK clock frequency for devices depending on FLASH latency and voltage range.

    |   Latency       | range 1<br>1.1V-1.2V| range 2<br>1.0V-1.1V| range 3<br>0.9 V-1.0V| range 4<br>0.9V |
    |-----------------|---------------------|---------------------|----------------------|-----------------|
    |0WS(1 CPU cycle) |  0 < HCLK <= 32     |  0 < HCLK <= 30     |    0 < HCLK <= 24    |  0 < HCLK <= 12 |
    |1WS(2 CPU cycles)| 32 < HCLK <= 64     | 30 < HCLK <= 60     |   24 < HCLK <= 48    | 12 < HCLK <= 25 |
    |2WS(3 CPU cycles)| 64 < HCLK <= 96     | 60 < HCLK <= 90     |   48 < HCLK <= 55    |        -        |
    |3WS(4 CPU cycles)| 96 < HCLK <= 128    | 90 < HCLK <= 110    |         -            |        -        |
    |4WS(5 CPU cycles)|128 < HCLK <= 144    |         -           |         -            |        -        |

    The table below shows the correspondence between wait states and CPU clock frequency.

    Table 2. HCLK clock frequency for devices depending on FLASH latency and voltage range.

    |   Latency         | range 1/2/3<br>0.9V-1.2V  | range 4<br>0.9V |
    |-------------------|---------------------------|-----------------|
    |0WS(1 CPU cycle)   |                           |  0 < HCLK <= 8  |
    |1WS(2 CPU cycles)  | WS >= HCLK (MHz) / 10 -1  |  8 < HCLK <= 16 |
    |2WS(3 CPU cycles)  |      Maximum HCLK         | 16 < HCLK <= 25 |
    |3WS(4 CPU cycles)  |      frequency is         |        -        |
    |       ...         |    given by Table 1       |        -        |
    |15WS(16 CPU cycles)|                           |        -        |

  - Reset functions:

    - Reset the RCC clock configuration to the default values (HSI at 48 MHz).
  * @{
  */

