MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
/** @defgroup RCC_Exported_Functions_Group1_0 Reset RCC and System clock to default values function
  * @brief    Functions to reset the RCC and system clock to default values.
  * @{
  */

void         HAL_RCC_Reset(void);
hal_status_t HAL_RCC_ResetSystemClock(void);

/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group1_1 RCC oscillators config service
  * @brief    Functions to configure the different oscillators.
  * @note     The following functions configure and activate the different oscillators
  *           Configuration can be done:
  *           - using the atomic functions defined for each oscillators
  *             -# like HAL_RCC_{OSC}_Enable: {OSC} is HSIS/HSIDIV3/HSIK/LSI/LSE/HSE/PSIS/PSIDIV3/PSIK
  *
  *           example: enable HSE oscillator
  *           - using atomic function (footprint optimisation):
  *             @code
  *             HAL_RCC_HSE_Enable(HAL_RCC_HSE_ON);
  *             @endcode
  *
  * @{
  */

/* HSI oscillator configuration and activation    ******************************/
hal_status_t        HAL_RCC_HSI_EnableInStopMode(void);
hal_status_t        HAL_RCC_HSI_DisableInStopMode(void);
hal_rcc_osc_stop_mode_status_t HAL_RCC_HSI_IsEnabledInStopMode(void);
hal_status_t        HAL_RCC_HSIS_Enable(void);
hal_status_t        HAL_RCC_HSIS_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_HSIS_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_HSIS_IsReady(void);
hal_status_t        HAL_RCC_HSIDIV3_Enable(void);
hal_status_t        HAL_RCC_HSIDIV3_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_HSIDIV3_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_HSIDIV3_IsReady(void);
hal_status_t        HAL_RCC_HSIK_Enable(hal_rcc_hsik_div_t divider);
hal_status_t        HAL_RCC_HSIK_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_HSIK_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_HSIK_IsReady(void);
hal_rcc_hsik_div_t HAL_RCC_HSIK_GetDivider(void);

/* LSI oscillator configuration and activation    ******************************/
hal_status_t        HAL_RCC_LSI_Enable(void);
hal_status_t        HAL_RCC_LSI_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_LSI_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_LSI_IsReady(void);

#if defined(HSE_VALUE)
/* HSE oscillator configuration and activation    ******************************/
hal_status_t        HAL_RCC_HSE_Enable(hal_rcc_hse_t mode);
hal_status_t        HAL_RCC_HSE_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_HSE_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_HSE_IsReady(void);

#endif /* HSE_VALUE */
#if defined(LSE_VALUE)
/* LSE oscillator configuration and activation    ******************************/
hal_status_t        HAL_RCC_LSE_Enable(hal_rcc_lse_t mode, hal_rcc_lse_drive_t drive);
hal_status_t        HAL_RCC_LSE_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_LSE_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_LSE_IsReady(void);

#endif /* LSE_VALUE */
/* PSI oscillator configuration and activation    ******************************/
hal_status_t        HAL_RCC_PSI_EnableInStopMode(void);
hal_status_t        HAL_RCC_PSI_DisableInStopMode(void);
hal_rcc_osc_stop_mode_status_t HAL_RCC_PSI_IsEnabledInStopMode(void);
hal_status_t        HAL_RCC_PSIS_Enable(void);
hal_status_t        HAL_RCC_PSIS_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_PSIS_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_PSIS_IsReady(void);
hal_status_t        HAL_RCC_PSIDIV3_Enable(void);
hal_status_t        HAL_RCC_PSIDIV3_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_PSIDIV3_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_PSIDIV3_IsReady(void);
hal_status_t        HAL_RCC_PSIK_Enable(hal_rcc_psik_div_t divider);
hal_status_t        HAL_RCC_PSIK_Disable(void);
hal_rcc_osc_enable_status_t HAL_RCC_PSIK_IsEnabled(void);
hal_rcc_osc_ready_status_t HAL_RCC_PSIK_IsReady(void);
hal_rcc_psik_div_t HAL_RCC_PSIK_GetDivider(void);
hal_status_t        HAL_RCC_PSI_SetConfig(const hal_rcc_psi_config_t *p_config);
void                HAL_RCC_PSI_GetConfig(hal_rcc_psi_config_t *p_config);
/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group1_2 RCC clock config service
  * @brief    Functions to configure the bus prescalers and retrieve bus clock frequencies (SYSCLK, HCLK and PCLKx).
  * @note     Unitary functions can be used to configure independently each bus.
  *
  *           example: all the BUS prescalers are set
  *
  *           - Call the global @ref HAL_RCC_SetBusClockConfig
  *             @code
  *               LL_FLASH_SetLatency(FLASH1, LL_FLASH_LATENCY_4WS);
  *               HAL_RCC_SetSYSCLKSource(HAL_RCC_SYSCLK_SRC_PLLCLK);
  *               hal_rcc_bus_clk_config_t config_bus;
  *               config_bus.hclk_prescaler  = HAL_RCC_HCLK_PRESCALER1;
  *               config_bus.pclk1_prescaler = HAL_RCC_PCLK_PRESCALER1;
  *               config_bus.pclk2_prescaler = HAL_RCC_PCLK_PRESCALER1;
  *               config_bus.pclk3_prescaler = HAL_RCC_PCLK_PRESCALER1;
  *               HAL_RCC_SetBusClockConfig(&config_bus);
  *             @endcode
  * @{
  */

hal_status_t          HAL_RCC_SetSYSCLKSource(hal_rcc_sysclk_src_t source);
hal_rcc_sysclk_src_t  HAL_RCC_GetSYSCLKSource(void);
void                  HAL_RCC_SetHCLKPrescaler(hal_rcc_hclk_prescaler_t prescaler);
void                  HAL_RCC_SetPCLK1Prescaler(hal_rcc_pclk_prescaler_t prescaler);
void                  HAL_RCC_SetPCLK2Prescaler(hal_rcc_pclk_prescaler_t prescaler);
void                  HAL_RCC_SetPCLK3Prescaler(hal_rcc_pclk_prescaler_t prescaler);
hal_rcc_hclk_prescaler_t    HAL_RCC_GetHCLKPrescaler(void);
hal_rcc_pclk_prescaler_t    HAL_RCC_GetPCLK1Prescaler(void);
hal_rcc_pclk_prescaler_t    HAL_RCC_GetPCLK2Prescaler(void);
hal_rcc_pclk_prescaler_t    HAL_RCC_GetPCLK3Prescaler(void);
hal_status_t          HAL_RCC_SetBusClockConfig(const hal_rcc_bus_clk_config_t *p_config);
void                  HAL_RCC_GetBusClockConfig(hal_rcc_bus_clk_config_t *p_config);

uint32_t              HAL_RCC_GetPSIClockFreq(void);
uint32_t              HAL_RCC_GetSYSCLKFreq(void);
uint32_t              HAL_RCC_GetHCLKFreq(void);
uint32_t              HAL_RCC_GetPCLK1Freq(void);
uint32_t              HAL_RCC_GetPCLK2Freq(void);
uint32_t              HAL_RCC_GetPCLK3Freq(void);

/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group1_3 RCC management of Systick external clock source
  * @brief    Functions to Set, Get the Systick external clock source and frequency.
  * @{
  */

void                       HAL_RCC_SetSysTickExternalClkSource(hal_rcc_systick_clk_src_t clk_src);
hal_rcc_systick_clk_src_t  HAL_RCC_GetSysTickExternalClkSource(void);
uint32_t                   HAL_RCC_GetSysTickExternalClkFreq(void);

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group2 Peripheral Clock management on buses
  This subsection provides a set of functions (on AHB1, AHB2, AHB4, APB1, APB2 or APB3 buses) allowing to:

  - Enable or disable the peripherals clock.
  - Reset of peripherals clock.
  - Enable or disable the peripherals clock in low power mode.
  * @{
  */

/** @defgroup RCC_Bus_Clock_Enable_Disable Bus Clock Enable Disable
  * @brief  Enable or disable the Bus peripheral clocks.
  * @{
  */

/**
  * @details This function enables the AHB1 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_AHB1_EnableBusClock(void)
{
  LL_AHB1_EnableBusClock();
}

/**
  * @details This function checks if AHB1 bus clock is enabled.
  * @retval  HAL_RCC_CLK_DISABLED AHB1 bus clock is disabled
  * @retval  HAL_RCC_CLK_ENABLED AHB1 bus clock is enabled
  */
__STATIC_INLINE hal_rcc_clk_status_t HAL_RCC_AHB1_IsEnabledBusClock(void)
{
  return (hal_rcc_clk_status_t)LL_AHB1_IsEnabledBusClock();
}

/**
  * @details This function disables the AHB1 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_AHB1_DisableBusClock(void)
{
  LL_AHB1_DisableBusClock();
}

/**
  * @details This function enables the AHB2 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_AHB2_EnableBusClock(void)
{
  LL_AHB2_EnableBusClock();
}

/**
  * @details This function checks if AHB2 bus clock is enabled.
  * @retval  HAL_RCC_CLK_DISABLED AHB2 bus clock is disabled
  * @retval  HAL_RCC_CLK_ENABLED AHB2 bus clock is enabled
  */
__STATIC_INLINE hal_rcc_clk_status_t HAL_RCC_AHB2_IsEnabledBusClock(void)
{
  return (hal_rcc_clk_status_t)LL_AHB2_IsEnabledBusClock();
}

/**
  * @details This function disables the AHB2 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_AHB2_DisableBusClock(void)
{
  LL_AHB2_DisableBusClock();
}
#if defined(AHB4PERIPH_BASE)

/**
  * @details This function enables the AHB4 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_AHB4_EnableBusClock(void)
{
  LL_AHB4_EnableBusClock();
}

/**
  * @details This function checks if AHB4 bus clock is enabled.
  * @retval  HAL_RCC_CLK_DISABLED AHB4 bus clock is disabled
  * @retval  HAL_RCC_CLK_ENABLED AHB4 bus clock is enabled
  */
__STATIC_INLINE hal_rcc_clk_status_t HAL_RCC_AHB4_IsEnabledBusClock(void)
{
  return (hal_rcc_clk_status_t)LL_AHB4_IsEnabledBusClock();
}

/**
  * @details This function disables the AHB4 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_AHB4_DisableBusClock(void)
{
  LL_AHB4_DisableBusClock();
}
#endif /* AHB4PERIPH_BASE */
/**
  * @details This function enables the APB1 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_APB1_EnableBusClock(void)
{
  LL_APB1_EnableBusClock();
}

/**
  * @details This function checks if APB1 bus clock is enabled.
  * @retval  HAL_RCC_CLK_DISABLED APB1 bus clock is disabled
  * @retval  HAL_RCC_CLK_ENABLED APB1 bus clock is enabled
  */
__STATIC_INLINE hal_rcc_clk_status_t HAL_RCC_APB1_IsEnabledBusClock(void)
{
  return (hal_rcc_clk_status_t)LL_APB1_IsEnabledBusClock();
}

/**
  * @details This function disables the APB1 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_APB1_DisableBusClock(void)
{
  LL_APB1_DisableBusClock();
}

/**
  * @details This function enables the APB2 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_APB2_EnableBusClock(void)
{
  LL_APB2_EnableBusClock();
}

/**
  * @details This function checks if APB2 bus clock is enabled.
  * @retval  HAL_RCC_CLK_DISABLED APB2 bus clock is disabled
  * @retval  HAL_RCC_CLK_ENABLED APB2 bus clock is enabled
  */
__STATIC_INLINE hal_rcc_clk_status_t HAL_RCC_APB2_IsEnabledBusClock(void)
{
  return (hal_rcc_clk_status_t)LL_APB2_IsEnabledBusClock();
}

/**
  * @details This function disables the APB2 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_APB2_DisableBusClock(void)
{
  LL_APB2_DisableBusClock();
}

/**
  * @details This function enables the APB3 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_APB3_EnableBusClock(void)
{
  LL_APB3_EnableBusClock();
}

/**
  * @details This function checks if APB3 bus clock is enabled.
  * @retval  HAL_RCC_CLK_DISABLED APB3 bus clock is disabled
  * @retval  HAL_RCC_CLK_ENABLED APB3 bus clock is enabled
  */
__STATIC_INLINE hal_rcc_clk_status_t HAL_RCC_APB3_IsEnabledBusClock(void)
{
  return (hal_rcc_clk_status_t)LL_APB3_IsEnabledBusClock();
}

/**
  * @details This function disables the APB3 Bus clock.
  */
__STATIC_INLINE void HAL_RCC_APB3_DisableBusClock(void)
{
  LL_APB3_DisableBusClock();
}
/**
  * @}
  */ /* RCC_Bus_Clock_Enable_Disable */

/** @defgroup RCC_AHB1_Peripheral_Clock_Enable_Disable AHB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it excepted for FLASH and SRAMx.
  * @{
  */
/**
  * @details This function enables the LPDMA1 clock.
  */
__STATIC_INLINE void HAL_RCC_LPDMA1_EnableClock(void)
{
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_LPDMA1);
}

#if defined(LPDMA2)
/**
  * @details This function enables the LPDMA2 clock.
  */
__STATIC_INLINE void HAL_RCC_LPDMA2_EnableClock(void)
{
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_LPDMA2);
}

#endif /* LPDMA2 */
/**
  * @details This function enables the FLASH clock.
  */
__STATIC_INLINE void HAL_RCC_FLASH_EnableClock(void)
{
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_FLASH);
}

/**
  * @details This function enables the CRC clock.
  */
__STATIC_INLINE void HAL_RCC_CRC_EnableClock(void)
{
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_CRC);
}

/**
  * @details This function enables the CORDIC clock.
  */
__STATIC_INLINE void HAL_RCC_CORDIC_EnableClock(void)
{
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_CORDIC);
}

/**
  * @details This function enables the RAMCFG clock.
  */
__STATIC_INLINE void HAL_RCC_RAMCFG_EnableClock(void)
{
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_RAMCFG);
}

