MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
#if defined(LPTIM1)
/**
  * @details This function resets the LPTIM1 peripheral.
  */
__STATIC_INLINE void HAL_RCC_LPTIM1_Reset(void)
{
  LL_APB3_GRP1_ForceReset(LL_APB3_GRP1_PERIPH_LPTIM1);
  LL_APB3_GRP1_ReleaseReset(LL_APB3_GRP1_PERIPH_LPTIM1);
}

#endif /* LPTIM1 */
/**
  * @}
  */

/** @defgroup RCC_AHB1_Peripheral_Clock_Sleep_Enable_Disable AHB1 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
/**
  * @details This function enables the LPDMA1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPDMA1_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_LPDMA1);
}

#if defined(LPDMA2)
/**
  * @details This function enables the LPDMA2 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPDMA2_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_LPDMA2);
}

#endif /* LPDMA2 */
/**
  * @details This function enables the FLASH clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_FLASH_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_FLASH);
}

/**
  * @details This function enables the CRC clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CRC_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_CRC);
}

/**
  * @details This function enables the CORDIC clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CORDIC_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_CORDIC);
}

/**
  * @details This function enables the RAMCFG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RAMCFG_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_RAMCFG);
}

#if defined(ETH1)
/**
  * @details This function enables the ETH1CK clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1CK_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1CK);
}

/**
  * @details This function enables the ETH1CK clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1CK_EnableClockInStopMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1CK);
}

/**
  * @details This function enables the ETH1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1);
}

/**
  * @details This function enables the ETH1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1_EnableClockInStopMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1);
}

/**
  * @details This function enables the ETH1TX clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1TX_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1TX);
}

/**
  * @details This function enables the ETH1TX clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1TX_EnableClockInStopMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1TX);
}

/**
  * @details This function enables the ETH1RX clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1RX_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1RX);
}

/**
  * @details This function enables the ETH1RX clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1RX_EnableClockInStopMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1RX);
}

#endif /* ETH1 */
/**
  * @details This function enables the ICACHE1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ICACHE1_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_ICACHE1);
}

/**
  * @details This function enables the SRAM2 clock in sleep mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM2_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM2);
}

/**
  * @details This function enables the SRAM2 clock in stop mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM2_EnableClockInStopMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM2);
}

/**
  * @details This function enables the SRAM1 clock in sleep mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM1_EnableClockInSleepMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM1);
}

/**
  * @details This function enables the SRAM1 clock in stop mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM1_EnableClockInStopMode(void)
{
  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM1);
}

/**
  * @details This function disables the LPDMA1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPDMA1_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_LPDMA1);
}

#if defined(LPDMA2)
/**
  * @details This function disables the LPDMA2 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPDMA2_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_LPDMA2);
}

#endif /* LPDMA2 */
/**
  * @details This function disables the FLASH clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_FLASH_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_FLASH);
}

/**
  * @details This function disables the CRC clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CRC_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_CRC);
}

/**
  * @details This function disables the CORDIC clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CORDIC_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_CORDIC);
}

/**
  * @details This function disables the RAMCFG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RAMCFG_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_RAMCFG);
}

/**
  * @details This function disables the ICACHE1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ICACHE1_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ICACHE1);
}

