MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
#if defined(ETH1)
/**
  * @details This function disables the ETH1CK clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1CK_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1CK);
}

/**
  * @details This function disables the ETH1CK clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1CK_DisableClockInStopMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1CK);
}

/**
  * @details This function disables the ETH1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1);
}

/**
  * @details This function disables the ETH1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1_DisableClockInStopMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1);
}

/**
  * @details This function disables the ETH1TX clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1TX_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1TX);
}

/**
  * @details This function disables the ETH1TX clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1TX_DisableClockInStopMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1TX);
}

/**
  * @details This function disables the ETH1RX clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1RX_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1RX);
}

/**
  * @details This function disables the ETH1RX clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ETH1RX_DisableClockInStopMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_ETH1RX);
}

#endif /* ETH1 */
/**
  * @details This function disables the SRAM2 clock in sleep mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM2_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM2);
}

/**
  * @details This function disables the SRAM2 clock in stop mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM2_DisableClockInStopMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM2);
}

/**
  * @details This function disables the SRAM1 clock in sleep mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM1_DisableClockInSleepMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM1);
}

/**
  * @details This function disables the SRAM1 clock in stop mode.
  */
__STATIC_FORCEINLINE void HAL_RCC_LP_SRAM1_DisableClockInStopMode(void)
{
  LL_AHB1_GRP1_DisableClockLowPower(LL_AHB1_GRP1_PERIPH_SRAM1);
}

/**
  * @}
  */

/** @defgroup RCC_AHB2_Peripheral_Clock_Sleep_Enable_Disable AHB2 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
/**
  * @details This function enables the GPIOA clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOA_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOA);
}

/**
  * @details This function enables the GPIOB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOB_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOB);
}

/**
  * @details This function enables the GPIOC clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOC_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOC);
}

/**
  * @details This function enables the GPIOD clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOD_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOD);
}

/**
  * @details This function enables the GPIOE clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOE_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOE);
}

#if defined(GPIOF)
/**
  * @details This function enables the GPIOF clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOF_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOF);
}

#endif /* GPIOF */
#if defined(GPIOG)
/**
  * @details This function enables the GPIOG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOG_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOG);
}

#endif /* GPIOG */
/**
  * @details This function enables the GPIOH clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOH_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOH);
}
/**
  * @details This function enables the ADC12 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ADC12_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_ADC12);
}

/**
  * @details This function enables the DAC1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_DAC1_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_DAC1);
}

/**
  * @details This function enables the DAC1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_DAC1_EnableClockInStopMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_DAC1);
}

#if defined(AES)
/**
  * @details This function enables the AES clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_AES_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_AES);
}

#endif /* AES */
/**
  * @details This function enables the HASH clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_HASH_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_HASH);
}

/**
  * @details This function enables the RNG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RNG_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_RNG);
}

