MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
#if defined(PKA)
/**
  * @details This function enables the PKA clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_PKA_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_PKA);
}

#endif /* PKA */
#if defined(SAES)
/**
  * @details This function enables the SAES clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SAES_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_SAES);
}

#endif /* SAES */
#if defined(CCB)
/**
  * @details This function enables the CCB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CCB_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_CCB);
}

#endif /* CCB */

#if defined(ADC3)
/**
  * @details This function enables the ADC3 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ADC3_EnableClockInSleepMode(void)
{
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_ADC3);
}

#endif /* ADC3 */
/**
  * @details This function disables the GPIOA clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOA_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOA);
}

/**
  * @details This function disables the GPIOB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOB_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOB);
}

/**
  * @details This function disables the GPIOC clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOC_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOC);
}

/**
  * @details This function disables the GPIOD clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOD_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOD);
}

/**
  * @details This function disables the GPIOE clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOE_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOE);
}

#if defined(GPIOF)
/**
  * @details This function disables the GPIOF clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOF_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOF);
}

#endif /* GPIOF */
#if defined(GPIOG)
/**
  * @details This function disables the GPIOG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOG_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOG);
}

#endif /* GPIOG */
/**
  * @details This function disables the GPIOH clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_GPIOH_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_GPIOH);
}
/**
  * @details This function disables the ADC12 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ADC12_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_ADC12);
}

/**
  * @details This function disables the DAC1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_DAC1_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_DAC1);
}

/**
  * @details This function disables the DAC1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_DAC1_DisableClockInStopMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_DAC1);
}

#if defined(AES)
/**
  * @details This function disables the AES clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_AES_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_AES);
}

#endif /* AES */
/**
  * @details This function disables the HASH clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_HASH_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_HASH);
}

/**
  * @details This function disables the RNG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RNG_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_RNG);
}

#if defined(PKA)
/**
  * @details This function disables the PKA clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_PKA_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_PKA);
}

#endif /* PKA */
#if defined(SAES)
/**
  * @details This function disables the SAES clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SAES_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_SAES);
}

#endif /* SAES */
#if defined(CCB)
/**
  * @details This function disables the CCB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CCB_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_CCB);
}

#endif /* CCB */
#if defined(ADC3)
/**
  * @details This function disables the ADC3 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_ADC3_DisableClockInSleepMode(void)
{
  LL_AHB2_GRP1_DisableClockLowPower(LL_AHB2_GRP1_PERIPH_ADC3);
}

#endif /* ADC3 */
/**
  * @}
  */

#if defined(XSPI1)
/** @defgroup RCC_AHB4_Peripheral_Clock_Sleep_Enable_Disable AHB4 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB4 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#if defined(XSPI1)
/**
  * @details This function enables the XSPI1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_XSPI1_EnableClockInSleepMode(void)
{
  LL_AHB4_GRP1_EnableClockLowPower(LL_AHB4_GRP1_PERIPH_XSPI1);
}

#endif /* XSPI1 */
#if defined(XSPI1)
/**
  * @details This function disables the XSPI1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_XSPI1_DisableClockInSleepMode(void)
{
  LL_AHB4_GRP1_DisableClockLowPower(LL_AHB4_GRP1_PERIPH_XSPI1);
}
/**
  * @}
  */

#endif /* XSPI1 */
#endif /* XSPI1 || XSPI2 || FMC_BASE */
/** @defgroup RCC_APB1_Peripheral_Clock_Sleep_Enable_Disable APB1 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Low Power Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
/**
  * @details This function enables the TIM2 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM2_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM2);
}

#if defined(TIM3)
/**
  * @details This function enables the TIM3 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM3_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM3);
}

#endif /* TIM3 */
#if defined(TIM4)
/**
  * @details This function enables the TIM4 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM4_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM4);
}

#endif /* TIM4 */
#if defined(TIM5)
/**
  * @details This function enables the TIM5 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM5_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM5);
}

#endif /* TIM5 */
/**
  * @details This function enables the TIM6 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM6_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM6);
}

/**
  * @details This function enables the TIM7 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM7_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM7);
}

/**
  * @details This function enables the TIM12 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM12_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_TIM12);
}

/**
  * @details This function enables the WWDG clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_WWDG_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_WWDG);
}

#if defined(OPAMP1)
/**
  * @details This function enables the OPAMP1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_OPAMP1_EnableClockInSleepMode(void)
{
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_OPAMP1);
}

