MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
#endif /* OPAMP1 */
/**
  * @details This function disables the SPI2 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI2_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_SPI2);
}

/**
  * @details This function disables the SPI2 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI2_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_SPI2);
}
#if defined(SPI3)
/**
  * @details This function disables the SPI3 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI3_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_SPI3);
}

/**
  * @details This function disables the SPI3 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI3_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_SPI3);
}

#endif /* SPI3 */
/**
  * @details This function disables the USART2 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART2_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_USART2);
}

/**
  * @details This function disables the USART2 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART2_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_USART2);
}
#if defined(USART3)
/**
  * @details This function disables the USART3 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART3_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_USART3);
}

/**
  * @details This function disables the USART3 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART3_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_USART3);
}

#endif /* USART3 */
/**
  * @details This function disables the UART4 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_UART4_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_UART4);
}

/**
  * @details This function disables the UART4 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_UART4_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_UART4);
}

/**
  * @details This function disables the UART5 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_UART5_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_UART5);
}

/**
  * @details This function disables the UART5 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_UART5_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_UART5);
}

#if defined(USART6)
/**
  * @details This function disables the USART6 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART6_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_USART6);
}

/**
  * @details This function disables the USART6 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART6_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_USART6);
}

#endif /* USART6 */
#if defined(UART7)
/**
  * @details This function disables the UART7 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_UART7_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_UART7);
}

/**
  * @details This function disables the UART7 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_UART7_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_UART7);
}

#endif /* UART7 */
/**
  * @details This function disables the I2C1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_I2C1_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_I2C1);
}

/**
  * @details This function disables the I2C1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_I2C1_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_I2C1);
}

#if defined(I2C2)
/**
  * @details This function disables the I2C2 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_I2C2_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_I2C2);
}

/**
  * @details This function disables the I2C2 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_I2C2_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_I2C2);
}

#endif /* I2C2 */
/**
  * @details This function disables the I3C1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_I3C1_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_I3C1);
}

/**
  * @details This function disables the I3C1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_I3C1_DisableClockInStopMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_I3C1);
}

/**
  * @details This function disables the CRS clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_CRS_DisableClockInSleepMode(void)
{
  LL_APB1_GRP1_DisableClockLowPower(LL_APB1_GRP1_PERIPH_CRS);
}
/**
  * @details This function disables the COMP12 clock in sleep mode.
  * @note    COMP2 not defined in all devices.
  */
__STATIC_INLINE void HAL_RCC_LP_COMP12_DisableClockInSleepMode(void)
{
  LL_APB1_GRP2_DisableClockLowPower(LL_APB1_GRP2_PERIPH_COMP12);
}

/**
  * @details This function disables the COMP12 clock in stop mode.
  * @note    COMP2 not defined in all devices.
  */
__STATIC_INLINE void HAL_RCC_LP_COMP12_DisableClockInStopMode(void)
{
  LL_APB1_GRP2_DisableClockLowPower(LL_APB1_GRP2_PERIPH_COMP12);
}

#if defined(FDCAN1)

/**
  * @details This function disables the FDCAN clock in sleep mode.
  * @note    The FDCAN clock is common for all FDCAN instances
  */
__STATIC_INLINE void HAL_RCC_LP_FDCAN_DisableClockInSleepMode(void)
{
  LL_APB1_GRP2_DisableClockLowPower(LL_APB1_GRP2_PERIPH_FDCAN);
}

#endif /* FDCAN1 */
/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Sleep_Enable_Disable APB2 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Low Power Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
/**
  * @details This function enables the TIM1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM1_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_TIM1);
}

/**
  * @details This function enables the SPI1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI1_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_SPI1);
}

/**
  * @details This function enables the SPI1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI1_EnableClockInStopMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_SPI1);
}

/**
  * @details This function enables the TIM8 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM8_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_TIM8);
}

/**
  * @details This function enables the USART1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART1_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_USART1);
}

/**
  * @details This function enables the USART1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART1_EnableClockInStopMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_USART1);
}

/**
  * @details This function enables the TIM15 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM15_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_TIM15);
}

#if defined(TIM16)
/**
  * @details This function enables the TIM16 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM16_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_TIM16);
}

#endif /* TIM16 */
#if defined(TIM17)
/**
  * @details This function enables the TIM17 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM17_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_TIM17);
}

#endif /* TIM17 */
#if defined(USB_DRD_FS_BASE)
/**
  * @details This function enables the USB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USB_EnableClockInSleepMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_USB);
}

/**
  * @details This function enables the USB clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USB_EnableClockInStopMode(void)
{
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_USB);
}

#endif /* USB_DRD_FS_BASE */
/**
  * @details This function disables the TIM1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM1_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_TIM1);
}

/**
  * @details This function disables the SPI1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI1_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_SPI1);
}

/**
  * @details This function disables the SPI1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SPI1_DisableClockInStopMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_SPI1);
}

/**
  * @details This function disables the TIM8 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM8_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_TIM8);
}

/**
  * @details This function disables the USART1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART1_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_USART1);
}

/**
  * @details This function disables the USART1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USART1_DisableClockInStopMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_USART1);
}

/**
  * @details This function disables the TIM15 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM15_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_TIM15);
}

#if defined(TIM16)
/**
  * @details This function disables the TIM16 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM16_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_TIM16);
}

#endif /* TIM16 */
#if defined(TIM17)
/**
  * @details This function disables the TIM17 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_TIM17_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_TIM17);
}

#endif /* TIM17 */
#if defined(USB_DRD_FS_BASE)
/**
  * @details This function disables the USB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USB_DisableClockInSleepMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_USB);
}

/**
  * @details This function disables the USB clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_USB_DisableClockInStopMode(void)
{
  LL_APB2_GRP1_DisableClockLowPower(LL_APB2_GRP1_PERIPH_USB);
}

#endif /* USB_DRD_FS_BASE */
/**
  * @}
  */

/** @defgroup RCC_APB3_Peripheral_Clock_Sleep_Enable_Disable APB3 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB3 peripheral clock during Low Power Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
/**
  * @details This function enables the SBS clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SBS_EnableClockInSleepMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_SBS);
}

/**
  * @details This function enables the LPUART1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPUART1_EnableClockInSleepMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_LPUART1);
}

/**
  * @details This function enables the LPUART1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPUART1_EnableClockInStopMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_LPUART1);
}
#if defined(LPTIM1)
/**
  * @details This function enables the LPTIM1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPTIM1_EnableClockInSleepMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_LPTIM1);
}

/**
  * @details This function enables the LPTIM1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPTIM1_EnableClockInStopMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_LPTIM1);
}

#endif /* LPTIM1 */
/**
  * @details This function enables the RTCAPB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RTCAPB_EnableClockInSleepMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_RTCAPB);
}

/**
  * @details This function enables the RTCAPB clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RTCAPB_EnableClockInStopMode(void)
{
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_RTCAPB);
}

/**
  * @details This function disables the SBS clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_SBS_DisableClockInSleepMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_SBS);
}

/**
  * @details This function disables the LPUART1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPUART1_DisableClockInSleepMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_LPUART1);
}

/**
  * @details This function disables the LPUART1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPUART1_DisableClockInStopMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_LPUART1);
}

