MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.h
#if defined(LPTIM1)
/**
  * @details This function disables the LPTIM1 clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPTIM1_DisableClockInSleepMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_LPTIM1);
}

/**
  * @details This function disables the LPTIM1 clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_LPTIM1_DisableClockInStopMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_LPTIM1);
}

#endif /* LPTIM1 */
/**
  * @details This function disables the RTCAPB clock in sleep mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RTCAPB_DisableClockInSleepMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_RTCAPB);
}

/**
  * @details This function disables the RTCAPB clock in stop mode.
  */
__STATIC_INLINE void HAL_RCC_LP_RTCAPB_DisableClockInStopMode(void)
{
  LL_APB3_GRP1_DisableClockLowPower(LL_APB3_GRP1_PERIPH_RTCAPB);
}

/**
  * @}
  */

/** @defgroup RCC_RTC_Reset RCC RTC Domain Reset
  * @brief  Reset the RTC domain.
  * @{
  */

/** @brief    Function to force and release the RTC domain.
  * @details  When a RTC domain reset occurs, the following domains are impacted:
  *           - the RTC is stopped and all the RTC registers are set to their reset values
  *             (including the backup registers)
  *           - all TAMP registers can be read or written.
  *           - LSE crystal 32kHz crystal oscillator
  *           - RCC_RTCCR register
  */
__STATIC_INLINE void HAL_RCC_ResetRTCDomain(void)
{
  LL_RCC_ForceRTCDomainReset();
  LL_RCC_ReleaseRTCDomainReset();
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group3 RCC services functions
  This subsection provides a set of functions allowing to:

  - Configure the MCO.
    - MCO (Microcontroller Clock Output): used to output HSIK, HSIS, HSIDIV3, PSIK, PSIS, PSIDIV3, LSE,
      LSI, HSE, SYSCLK on a pin.

  - Get and clear reset flags

  - Enable the Clock Security System.
    - CSS (Clock Security System): once enabled, if a HSE clock failure occurs
    (HSE used directly or through PSI as System clock source), the System clock
    is automatically switched to HSI.
    If a LSE clock failure occurs (LSE used through PSI as System clock source), the System clock
    is automatically switched to HSI.
    The CSS is linked to the Cortex-M33 NMI (non-maskable interrupt) exception vector.
    The NMI is executed indefinitely unless the CSS interrupt flag (CSSF) pending bit is cleared.
    Therefore, in the NMI ISR, ensure to clear the CSSF by setting the CSSC bit.

  - Enable Clock security system on LSE.

  - Configure and get the oscillator Kernel clock source for wakeup from Stop.

  - Enable output (LSCO) allows one of the low-speed clocks below to be output onto the external LSCO pin:
    - LSI
    - LSE
    - This output remains available in all Stop modes and Standby mode

  - Enable RTC and TAMP clock
  *
  * @{
  */

void                         HAL_RCC_SetConfigMCO(hal_rcc_mco_src_t mcox_src, hal_rcc_mco_prescaler_t mco_prescaler);
uint32_t                     HAL_RCC_GetResetSource(void);
void                         HAL_RCC_ClearResetFlags(void);
#if defined(HSE_VALUE)
void                         HAL_RCC_HSE_EnableCSS(void);
hal_status_t                 HAL_RCC_HSE_CSSCallback(void);
void                         HAL_RCC_RTC_SetHSEPrescaler(uint32_t prescaler);
uint32_t                     HAL_RCC_RTC_GetHSEPrescaler(void);
#endif /* HSE_VALUE */
hal_status_t                 HAL_RCC_NMI_IRQHandler(void);
void                         HAL_RCC_SetClockAfterWakeFromStop(hal_rcc_stop_wakeup_clk_t wakeup_clk);
hal_rcc_stop_wakeup_clk_t    HAL_RCC_GetClockAfterWakeFromStop(void);
#if defined(LSE_VALUE)
void                         HAL_RCC_LSE_EnableCSS(void);
void                         HAL_RCC_LSE_DisableCSS(void);
hal_status_t                 HAL_RCC_LSE_CSSCallback(void);
#endif /* LSE_VALUE */
hal_status_t                 HAL_RCC_EnableLSCO(hal_rcc_lsco_src_t source);
hal_status_t                 HAL_RCC_DisableLSCO(void);
hal_status_t                 HAL_RCC_RTC_EnableKernelClock(void);
hal_status_t                 HAL_RCC_RTC_DisableKernelClock(void);
/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group4 Kernel clock source configuration for peripherals
  This subsection provides a set of functions:
  - to control Kernel clock source configuration for peripherals
  - to control specific Kernel clock prescaler for peripherals if available
  - to get peripheral clock frequency

  Only functions having a kernel clock are handled by these functions.

    - The peripheral clock can be selected through the independent
      - API HAL_RCC_{PERIPHx}_SetKernelClkSource(hal_rcc_{periphx}_clk_src_t clk_src)
      example: @ref HAL_RCC_USART1_SetKernelClkSource(hal_rcc_usart1_clk_src_t clk_src)

      Usage: activate PSIK as clock source of USART1

      - with @ref HAL_RCC_USART1_SetKernelClkSource function:
      @code
        HAL_RCC_USART1_SetKernelClkSource(HAL_RCC_USART1_CLK_SRC_PSIK);
      @endcode

      - to get the peripheral Clocks frequencies:
      API hal_rcc_{periphx}_clk_src_t HAL_RCC_{PERIPHx}_GetKernelClkSource(void)


    - The peripheral clock can be divided by a specific value
      - API HAL_RCC_{PERIPHx}_SetKernelClkPrescaler(hal_rcc_{periphx}_prescaler_t prescaler)
      example: @ref HAL_RCC_ADCDAC_SetKernelClkPrescaler(hal_rcc_adcdac_prescaler_t prescaler)
      - API HAL_RCC_{PERIPHx}_prescaler_t HAL_RCC_{PERIPHx}_GetKernelClkPrescaler(void)
      example: @ref hal_rcc_adcdac_prescaler_t HAL_RCC_ADCDAC_GetKernelClkPrescaler(void)

    - The functionalities of the two previous functions are merged into one common function
      - API HAL_RCC_{PERIPHx}_SetConfigKernelClk(hal_rcc_{periphx}_clk_src_t clk_src,
                                            hal_rcc_{periphx}_prescaler_t prescaler)
      example: @ref HAL_RCC_ADCDAC_SetConfigKernelClk(hal_rcc_adcdac_clk_src_t clk_src,
                                                    hal_rcc_adcdac_prescaler_t prescaler)
      - API HAL_RCC_{PERIPHx}_GetConfigKernelClk(hal_rcc_{periphx}_clk_src_t clk_src,
                                            hal_rcc_{periphx}_prescaler_t prescaler)
      example: @ref HAL_RCC_ADCDAC_GetConfigKernelClk(hal_rcc_adcdac_clk_src_t *p_clk_src,
                                                    hal_rcc_adcdac_prescaler_t *p_prescaler)


    - All peripherals can get their peripheral clock frequency
      - API uint32_t HAL_RCC_{PERIPHx}_GetKernelClkFreq(void)
      example: @ref HAL_RCC_USART1_GetKernelClkFreq(void)

  * @{
  */

hal_status_t             HAL_RCC_USART1_SetKernelClkSource(hal_rcc_usart1_clk_src_t clk_src);
hal_status_t             HAL_RCC_USART2_SetKernelClkSource(hal_rcc_usart2_clk_src_t clk_src);
#if defined(USART3)
hal_status_t             HAL_RCC_USART3_SetKernelClkSource(hal_rcc_usart3_clk_src_t clk_src);
#endif /* USART3 */
hal_status_t             HAL_RCC_UART4_SetKernelClkSource(hal_rcc_uart4_clk_src_t clk_src);
hal_status_t             HAL_RCC_UART5_SetKernelClkSource(hal_rcc_uart5_clk_src_t clk_src);
#if defined(USART6)
hal_status_t             HAL_RCC_USART6_SetKernelClkSource(hal_rcc_usart6_clk_src_t clk_src);
#endif /* USART6 */
#if defined(UART7)
hal_status_t             HAL_RCC_UART7_SetKernelClkSource(hal_rcc_uart7_clk_src_t clk_src);
#endif /* UART7 */
hal_status_t             HAL_RCC_LPUART1_SetKernelClkSource(hal_rcc_lpuart1_clk_src_t clk_src);
hal_status_t             HAL_RCC_SPI1_SetKernelClkSource(hal_rcc_spi1_clk_src_t clk_src);
hal_status_t             HAL_RCC_SPI2_SetKernelClkSource(hal_rcc_spi2_clk_src_t clk_src);
#if defined(SPI3)
hal_status_t             HAL_RCC_SPI3_SetKernelClkSource(hal_rcc_spi3_clk_src_t clk_src);
#endif /* SPI3 */
#if defined(FDCAN1)
hal_status_t             HAL_RCC_FDCAN_SetKernelClkSource(hal_rcc_fdcan_clk_src_t clk_src);
#endif /* FDCAN1 */
hal_status_t             HAL_RCC_I2C1_SetKernelClkSource(hal_rcc_i2c1_clk_src_t clk_src);
#if defined(I2C2)
hal_status_t             HAL_RCC_I2C2_SetKernelClkSource(hal_rcc_i2c2_clk_src_t clk_src);
#endif /* I2C2 */
hal_status_t             HAL_RCC_I3C1_SetKernelClkSource(hal_rcc_i3c1_clk_src_t clk_src);
hal_status_t             HAL_RCC_ADCDAC_SetKernelClkSource(hal_rcc_adcdac_clk_src_t clk_src);
hal_status_t             HAL_RCC_DAC1_SetSampleHoldClkSource(hal_rcc_dac1_sh_clk_src_t clk_src);
#if defined(LPTIM1)
hal_status_t             HAL_RCC_LPTIM1_SetKernelClkSource(hal_rcc_lptim1_clk_src_t clk_src);
#endif /* LPTIM1 */
hal_status_t             HAL_RCC_CK48_SetKernelClkSource(hal_rcc_ck48_clk_src_t clk_src);
#if defined(XSPI1)
hal_status_t             HAL_RCC_XSPI1_SetKernelClkSource(hal_rcc_xspi1_clk_src_t clk_src);
#endif /* XSPI1 */
#if defined(ETH1)
hal_status_t             HAL_RCC_ETH1REF_SetKernelClkSource(hal_rcc_eth1ref_clk_src_t clk_src);
hal_status_t             HAL_RCC_ETH1PTP_SetKernelClkSource(hal_rcc_eth1ptp_clk_src_t clk_src);
hal_status_t             HAL_RCC_ETH1_SetKernelClkSource(hal_rcc_eth1_clk_src_t clk_src);
#endif /* ETH1 */
hal_status_t             HAL_RCC_RTC_SetKernelClkSource(hal_rcc_rtc_clk_src_t clk_src);

hal_rcc_usart1_clk_src_t  HAL_RCC_USART1_GetKernelClkSource(void);
hal_rcc_usart2_clk_src_t  HAL_RCC_USART2_GetKernelClkSource(void);
#if defined(USART3)
hal_rcc_usart3_clk_src_t  HAL_RCC_USART3_GetKernelClkSource(void);
#endif /* USART3 */
hal_rcc_uart4_clk_src_t   HAL_RCC_UART4_GetKernelClkSource(void);
hal_rcc_uart5_clk_src_t   HAL_RCC_UART5_GetKernelClkSource(void);
#if defined(USART6)
hal_rcc_usart6_clk_src_t  HAL_RCC_USART6_GetKernelClkSource(void);
#endif /* USART6 */
#if defined(UART7)
hal_rcc_uart7_clk_src_t   HAL_RCC_UART7_GetKernelClkSource(void);
#endif /* UART7 */
hal_rcc_lpuart1_clk_src_t HAL_RCC_LPUART1_GetKernelClkSource(void);
hal_rcc_spi1_clk_src_t    HAL_RCC_SPI1_GetKernelClkSource(void);
hal_rcc_spi2_clk_src_t    HAL_RCC_SPI2_GetKernelClkSource(void);
#if defined(SPI3)
hal_rcc_spi3_clk_src_t    HAL_RCC_SPI3_GetKernelClkSource(void);
#endif /* SPI3 */
#if defined(FDCAN1)
hal_rcc_fdcan_clk_src_t   HAL_RCC_FDCAN_GetKernelClkSource(void);
#endif /* FDCAN1 */
hal_rcc_i2c1_clk_src_t    HAL_RCC_I2C1_GetKernelClkSource(void);
#if defined(I2C2)
hal_rcc_i2c2_clk_src_t    HAL_RCC_I2C2_GetKernelClkSource(void);
#endif /* I2C2 */
hal_rcc_i3c1_clk_src_t    HAL_RCC_I3C1_GetKernelClkSource(void);
hal_rcc_adcdac_clk_src_t  HAL_RCC_ADCDAC_GetKernelClkSource(void);
hal_rcc_dac1_sh_clk_src_t    HAL_RCC_DAC1_GetSampleHoldClkSource(void);
#if defined(LPTIM1)
hal_rcc_lptim1_clk_src_t  HAL_RCC_LPTIM1_GetKernelClkSource(void);
#endif /* LPTIM1 */
hal_rcc_ck48_clk_src_t HAL_RCC_CK48_GetKernelClkSource(void);
#if defined(XSPI1)
hal_rcc_xspi1_clk_src_t   HAL_RCC_XSPI1_GetKernelClkSource(void);
#endif /* XSPI1 */
#if defined(ETH1)
hal_rcc_eth1ref_clk_src_t  HAL_RCC_ETH1REF_GetKernelClkSource(void);
hal_rcc_eth1ptp_clk_src_t  HAL_RCC_ETH1PTP_GetKernelClkSource(void);
hal_rcc_eth1_clk_src_t     HAL_RCC_ETH1_GetKernelClkSource(void);
#endif /* ETH1 */
hal_rcc_rtc_clk_src_t     HAL_RCC_RTC_GetKernelClkSource(void);

hal_status_t               HAL_RCC_ADCDAC_SetKernelClkPrescaler(hal_rcc_adcdac_prescaler_t prescaler);
hal_rcc_adcdac_prescaler_t HAL_RCC_ADCDAC_GetKernelClkPrescaler(void);
hal_status_t               HAL_RCC_ADCDAC_SetConfigKernelClk(hal_rcc_adcdac_clk_src_t clk_src,
                                                             hal_rcc_adcdac_prescaler_t prescaler);
void                       HAL_RCC_ADCDAC_GetConfigKernelClk(hal_rcc_adcdac_clk_src_t *p_clk_src,
                                                             hal_rcc_adcdac_prescaler_t *p_prescaler);
#if defined(ETH1)
hal_status_t                HAL_RCC_ETH1_SetKernelClkPrescaler(hal_rcc_eth1_prescaler_t eth_prescaler);
hal_rcc_eth1_prescaler_t    HAL_RCC_ETH1_GetKernelClkPrescaler(void);
hal_status_t                HAL_RCC_ETH1_SetConfigKernelClk(hal_rcc_eth1_clk_src_t clk_src,
                                                            hal_rcc_eth1_prescaler_t eth_prescaler);
void                        HAL_RCC_ETH1_GetConfigKernelClk(hal_rcc_eth1_clk_src_t *p_clk_src,
                                                            hal_rcc_eth1_prescaler_t *p_prescaler);
hal_status_t                HAL_RCC_ETH1PTP_SetKernelClkPrescaler(uint32_t ethptp_prescaler);
uint32_t                    HAL_RCC_ETH1PTP_GetKernelClkPrescaler(void);
hal_status_t                HAL_RCC_ETH1PTP_SetConfigKernelClk(hal_rcc_eth1ptp_clk_src_t clk_src,
                                                               uint32_t ethptp_prescaler);
void                        HAL_RCC_ETH1PTP_GetConfigKernelClk(hal_rcc_eth1ptp_clk_src_t *p_clk_src,
                                                               uint32_t *p_prescaler);
#endif /* ETH1 */

uint32_t                  HAL_RCC_USART_GetKernelClkFreq(const USART_TypeDef *usartx);
uint32_t                  HAL_RCC_UART_GetKernelClkFreq(const USART_TypeDef *uartx);
uint32_t                  HAL_RCC_USART1_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_USART2_GetKernelClkFreq(void);
#if defined(USART3)
uint32_t                  HAL_RCC_USART3_GetKernelClkFreq(void);
#endif /* USART3 */
uint32_t                  HAL_RCC_UART4_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_UART5_GetKernelClkFreq(void);
#if defined(USART6)
uint32_t                  HAL_RCC_USART6_GetKernelClkFreq(void);
#endif /* USART6 */
#if defined(UART7)
uint32_t                  HAL_RCC_UART7_GetKernelClkFreq(void);
#endif /* UART7 */
uint32_t                  HAL_RCC_LPUART1_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_SPI_GetKernelClkFreq(const SPI_TypeDef *spix);
uint32_t                  HAL_RCC_SPI1_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_SPI2_GetKernelClkFreq(void);
#if defined(SPI3)
uint32_t                  HAL_RCC_SPI3_GetKernelClkFreq(void);
#endif /* SPI3 */
#if defined(FDCAN1)
uint32_t                  HAL_RCC_FDCAN_GetKernelClkFreq(void);
#endif /* FDCAN1 */
uint32_t                  HAL_RCC_I2C_GetKernelClkFreq(const I2C_TypeDef *i2cx);
uint32_t                  HAL_RCC_I2C1_GetKernelClkFreq(void);
#if defined(I2C2)
uint32_t                  HAL_RCC_I2C2_GetKernelClkFreq(void);
#endif /* I2C2 */
uint32_t                  HAL_RCC_I3C_GetKernelClkFreq(const I3C_TypeDef *i3cx);
uint32_t                  HAL_RCC_I3C1_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_ADC_GetKernelClkFreq(const ADC_TypeDef *adcx);
uint32_t                  HAL_RCC_ADCDAC_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_DAC_GetKernelClkFreq(const DAC_TypeDef *dacx);
#if defined(LPTIM1)
uint32_t                  HAL_RCC_LPTIM_GetKernelClkFreq(const LPTIM_TypeDef *lptimx);
uint32_t                  HAL_RCC_LPTIM1_GetKernelClkFreq(void);
#endif /* LPTIM1 */
uint32_t                  HAL_RCC_TIM_GetKernelClkFreq(const TIM_TypeDef *timx);
#if defined(XSPI1)
uint32_t                  HAL_RCC_XSPI_GetKernelClkFreq(const XSPI_TypeDef *xspix);
uint32_t                  HAL_RCC_XSPI1_GetKernelClkFreq(void);
#endif /* XSPI1 */
#if defined(ETH1)
uint32_t                  HAL_RCC_ETH1PTP_GetKernelClkFreq(void);
uint32_t                  HAL_RCC_ETH1_GetKernelClkFreq(void);
#endif /* ETH1 */

uint32_t                  HAL_RCC_DAC1_GetSampleHoldClkFreq(void);
uint32_t                  HAL_RCC_RTC_GetKernelClkFreq(void);
/**
  * @}
  */

/** @defgroup RCC_Exported_Functions_Group5 RCC privileged access levels attributes management
  * This subsection provides a set of functions:
  * @{
  */
hal_status_t  HAL_RCC_SetPrivAttr(uint32_t item, hal_rcc_priv_attr_t priv_attr);
hal_rcc_priv_attr_t HAL_RCC_GetPrivAttr(uint32_t item);
/**
  * @}
  */ /* RCC_Exported_Functions_Group5 */

/**
  * @}
  */

#endif /* RCC */
/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_RCC_H */
